package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 05/05/2018.
 */

public class AnimalsQuestions {


    public String listQuestionsAnimals [] = {

            //10
            " صوت الذئب يسمى ..؟",
            "ابن الأسد يسمى..؟",
            " صوت الأسد  يسمى..؟",
            "أكبر طائر هو ..؟",
            "أصغر طائر هو ..؟",
            "الطائر الوحيد الذي يستطيع أن يعمر أكثر من مائة سنة هو..؟",
            " يعتبر الحوت من ..؟",
            " كائن يعيش في الماء ولكنه ليس من الأسماك بل من الثديات التي تلد وترضع صغارها.. فما هو؟",
            "الكائن الذي يتلون عرقه باللون الأحمر هو ..؟",
            "أكثر الحيوانات تحملاَ للعطش وحياة الصحراء فهو يستطيع البقاء لعدة شهوربدون ماء أو طعام. هو..؟",

            //20
            "الحيوان الوحيد الذي لا يغمض عيونه, لأنها ليس لها جفون وعندما تنام يغطي عيونها غشاء لحمي رقيق هو..؟",
            "الحيوان الوحيد الذي له أربع ركب هو ..؟",
            "الحيوان الوحيد الذي يمكنه أن يبكي من شدة الألم هو ..؟",
            "الحيوان الذي يعتبر لسانه هو سلاحه الدائم فهو مملوء بغدد تفرز سائلا مطهرا يساعد على التئام جروحه .. هو ..؟",
            "الحيوان الذي يسمى بالحيوان الكسول لأنه ينام 19 ساعة  في اليوم  هو ..؟",
            " أسرع الحيوانات هو ..؟",
            "أكثر أنواع الأسماك السامة في العالم هي ..؟",
            "الحيوان الذي لا يشرب الماء اطلاقا هو ..؟",
            "الحيوان الذي ينام ستة أشهر ويستيقظ ستة أشهر هو ..؟",
            " أكثر الحيوانات ذكاء هو ..؟",

            //30
            " من البرمائيات التي تعمر طويلاً حيث تعيش من۴۰۰  الى ۳۰۰ سنة هي ..؟",
            "يبلغ طول الحوت الأزرق تقريبا..؟",
            "من الكائنات البحرية الذي لا ينام في الماء أبداً بل ينام على الشاطئ هو...؟",
            "الأنثى التي تلد وتعيش في الماء وتستمر في رضاعة الصغير حوالي ۱۸ شهراَ هي أنثى ...؟",
            "الكائن الذي له ۸ أذرع وقلبان وعينان هو..؟",
            "أكبر بيضة هي بيضة ..؟",
            "ابن الفيل يسمى ..؟",
            "من الحشرات التي سميت أحدى سور القرآن الكريم بأسمها حشرة ..؟",
            "الحشرة التي ذكرت في سورة الحج هي..؟",
            "أسرع الطيور هو طير ..؟",

            //40
            "الحيوانات التي لا تسمع وليس لها أذان هي ..؟",
            "كم  للنحلة عيون ؟",
            "الحشرة التي ذكرت في سورة البقرة هي ...؟",
            "من الحشرات التي سميت أحدى سور القرآن الكريم بأسمها هي..؟",
            "أطول معدة حيوان هي معدة..؟",
            "كم للفراشة أرجل..؟",
            "الكائن الوحيد الذي يستطيع تحمل برودة أعلى قمة في العالم .. هو ؟",
            "الحيوان الذي عضو الشم عنده لسانها ذو الشعب هو..؟",
            "صوت النعامة يسمى..؟",
            "كم عدد أسنان الكلب ؟",

            //50
            " صوت الحمام يسمى..؟",
            "صوت القرد يسمى..؟",
            "الحيوان الوحيد الذي يستطيع أن يميز الآلوان هو..؟",
            "الحيوان الذي يسمع من قدميه هو..؟",
            "المخلوق الأعمى هو ..؟",
            "صوت الحمار يسمى..؟",
            "صوت الحصان يسمى..؟",
            "صوت الناقة يسمى..؟",
            "صوت الفأر يسمى..؟",
            "ابن الأسد يسمى ..؟",

            //60
            "صوت القط يسمى..؟",
            "ابن الحصان يسمى ..؟",
            "صوت الكلب يسمى..؟",
            "ابن الحمار يسمى  ..؟",
            "صوت الغزال يسمى..؟",
            "الطائر الوحيد الذي يستطيع تمييز اللون الأزرق هو ..؟",
            "اللون الذي لا يمكن للنحل رؤيته هو اللون..؟",
            "حيوان يضرب به المثل في الخيانة فيقال أخون من ..؟",
            "حيوان يضرب به في الروى فيقال أروى من ...؟",
            "حيوان يضرب به المثل في الشكر فيقال أشكر من....؟",

            //70
            "طائر يضرب به المثل في الزهو والخيلاء فيقال أزهى من...؟",
            "طائر يضرب به المثل في الصدق فيقال أصدق من ...؟",
            "الحيوان الذي لديه أكبر قلب هو....؟",
            "طائر يضرب به المثل في الإبكار فيقال أبكر من..؟",
            "حشرة يضرب بها المثل بجمع الطعام فيقال أجمع من ...؟",
            "ابن الدب يسمى ...؟",
            "الظليم أسم يطلق على ذكر أحد الطيور هو ..؟",
            "العريرهو صوت...؟",
            "ماذا يسمى صوت النسر؟",
            " ماذا يسمى صوت العصفور؟",

            //80
            "الفرعل هو ابن ...؟",
            " ما أسرع الأسماك البحرية؟",
            "ابن الظبية يسمى ...؟",
            "أكمل المثل العربي القائل: إن لم تكن ذئباً أكلتك..؟",
            "ماذا يسمى صوت الحية؟",
            "حوالي كم شهراً تبلغ مدة حمل أنثى الفيل إذا كان الحمل سليماً؟",
            "ما هي الحشرات الأكثر إتلافاً للمحاصيل؟",
            "ما هو الحيوان الذي يأكل صغاره إذا جاع ؟",
            "ما هو الحيوان الذي يصاب بالحصبة كالإنسان ؟",
            " من هو أقوي الحيوانات ذاكرة ؟",

            //90
            "ماهو الحيوان الذي لا يتنفس وفمه مفتوح ابدا ؟",
            "ماهو الحيوان الذي لا يستطيع العوم في الماء ؟",
            "الى اي فصيلة ينتمي الجمبري من الحيوانات؟",
            "ما اسم الذباب الذي يسبب مرض النوم؟",
            "ما هو صوت الارنب؟",
            "ما اسم الطائر الوحيد الذي تكلّم في القرآن الكريم؟",
            "ماذا تسمّى عملية تغيير الزواحف جلودها خلال السنة؟",
            "أي تلك الطيور يملك أكثر عدد فقرات في عنقه؟",
            " ما هي الحشرة التي تصنع خيوط الحرير ؟",
            " ما الحيوان الأبكم الذي لايسمع له صوت ؟",

            //100
            "ماذا تأكل الغوريلا ؟",
            "للإنسان عشرون إصبعاً فكم إصبعاً للقط ؟",
            "ما هو طعام الشمبانزي المفضل ؟",
            "ما الناقل لمرض التيفوس ؟",
            "ما الموطن الأصلي لطيور الحبش ؟",
            " ما الحيوان الذي له أكبر عدد من الأسنان ؟",
            " ما هي آخر الحواس التي تنضج عند القطه ؟",
            "ما هو الموطن الأصلي للديك الرومي ؟",
            "كم يوما تحضن الدجاجة البيض حتى يخرج منها الكتاكيت ؟",
            "كم إصبعاً في كل رجل من أرجل النعامة ؟"

    };
    public String multipeChoiceAnimals [][] = {

            //10
            {"عواء", "نباح", "زئير", "سليل"},
            {"المهر", "الشبل", "الجحش", "الجدي"},
            {"زائير", "خوار", "نهير", "عواء"},
            {"الهيثم", "البجعه", "النعامة", "النسر"},
            {"الوروار", "الطنان", "الوطواط", "الزنان"},
            {"الصقر", "البط", "النعامة", "النسر"},
            {"الحشرات", "الطيور", "الثديات", "الأسماك"},
            {"الضفدع", "الجنبري", "الاخطبوط", "الحوت"},
            {"فرس النهر", "عجل البحر", "الحوت", "عجل النهر"},
            {"القنفد", "الجمل", "النمر", "الفأر"},

            //20
            {"القنفد", "الظبي", "الأرنب", "الفأرة"},
            {"الجمل", "الفيل", "الجاموس", "القط"},
            {"الضب", "الجمل", "الفيل", "الدب"},
            {"الكلب", "القط", "النمر", "الثعبان"},
            {"النمر", "الفيل", "الأسد", "الزرافه"},
            {"الغزال", "الفهد", "الأسد", "الأرنب"},
            {"سمكة الحجر", "سمكة التونة", "سمكة البلوط", "سمكة الخرفيش"},
            {"الذئب", "الزرافة", "الفيل", "الغزال"},
            {"القنفد", "الفأر", "الثعبان", "السحلية"},
            {"الضبع", "الدب", "الشمبانزي", "الكلب"},

            //30
            {"التمساح", "السلحفاة", "الضفدع", "عجل البحر"},
            {"10 قدماً", "20 قدماً", "30 قدماً", "40 قدماً"},
            {"عجل النهر", "سبع البحر", "فرس النهر", "فرس البحر"},
            {"الحوت", "البطريق", "الدولفين", "عجل البحر"},
            {"النحلة", "العقرب", "الأخطبوط", "الجنبري"},
            {"النعامة", "النسر", "البطريق", "البط"},
            {"الخرنق", "الدعفل", "الفرغل", "الدرص"},
            {"العنكبوت", "الجراد", "البعوضة", "الذباب"},
            {"النحل", "العنكبوت", "البعوضة", "الذباب"},
            {"الشاهين", "الحمام", "النورس", "النسر"},

            //40
            {"التماسيح", "الضفادع", "السحالي", "الثعابين"},
            {"2 عيون", "3 عيون", "5 عيون", "7 عيون"},
            {"النحل", "البعوضة", "الذباب", "العنكبوت"},
            {"الجراد", "البعوض", "النمل", "الذباب"},
            {"الخروف", "الزرافه", "الضبع", "الأرنب"},
            {"4 أرجل", "6 أرجل", "8 أرجل", "10 أرجل"},
            {"العنكبوت", "الحية", "الثعبان", "العقرب"},
            {"السحلية", "الحية", "التمساح", "الثعبان"},
            {"نغيق", "نعيق", "صفير", "زمار"},
            {"12 سناً", "22 سناً", "32 سناً", "42 سناً"},

            //50
            {"زجيل", "صفير", "هديل", "زجل"},
            {"نباح", "صياح", "ضحك", "قهقهه"},
            {"النمر", "القرد", "القط", "الكلب"},
            {"الارنب", "القرد", "الجندب", "السرو"},
            {"الثعبان", "السلحفات", "دودة القز", "دودة الأرض"},
            {"نهيق", "نعيق", "نغيق", "نقيق"},
            {"خوار", "حنين", "صهيل", "نهيق"},
            {"نهيم", "حنين", "خوار", "ضغيم"},
            {"صرير", "عرير", "فحيح", "نهيز"},
            {"الشبل", "الجرو", "الجحش", "المهر"},

            //60
            {"رغاء", "مغاء", "مواء", "غواء"},
            {"المهر", "الخيل", "الفرس", "الجحش"},
            {"نهيز", "نباح", "صياح", "عواء"},
            {"العجش", "البغل", "الجحش", "المهر"},
            {"نهيم", "أزيز", "سليل", "صليل"},
            {"الضقر", "البومة", "الغراب", "الهدهد"},
            {"البرتقالي", "الأزرق", "الأسود", "الأبيض"},
            {"ضبع", "نمر", "ثعلب", "ذئب"},
            {"جمل", "أرنب", "ضب", "ضبع"},
            {"جمل", "كلب", "ذئب", "قط"},

            //70
            {"بغبغاء", "هدهد", "ديك", "طاووس"},
            {"هدهد", "قطاة", "الحمامة", "اليمامة"},
            {"الأسد", "الجمل", "الفيل", "الزرافة"},
            {"غراب", "حمامة", "شاهين", "صافر"},
            {"جرادة", "نملة", "فراشة", "نحلة"},
            {"الغيثم", "الهيثم", "الرأل", "الديسم"},
            {"ذكر النعامة", "ذكر الدجاجة", "ذكر البومة", "ذكراليمامة"},
            {"الذباب", "الجراد", "الصرصار", "الفأر"},
            {"صياح", "نغيق", "صفير", "نعيق"},
            {"طنين", "زقزقة", "صرير", "تغريد"},

            //80
            {"الدب", "الضبع", "الأرنب", "الثعلب"},
            {"الدلفين", "التونه", "أبو منشار", "الحوت الأزرق"},
            {"درص", "ثقف", "هجرس", "رشا"},
            {"الثعالب", "الذئاب", "النعاج", "الكلاب"},
            {"فحيح", "وصيص", "صفير", "وزيز"},
            {"12 شهراً", "16 شهراً", "20 شهراً", "22 شهراً"},
            {"الجراد", "الذباب", "النحل", "النمل"},
            {"الفيل", "النمر", "البغل", "الاسد"},
            {"القط", "الفار", "القرد", "الكلب"},
            {"الخروف", "الثور", "الحمار", "الجمل"},

            //90
            {"الضفدع", "الاخطابوط", "التمساح", "الضب"},
            {"الفهد", "الاسد", "الخنزير", "الكلب"},
            {"القشريات", "السنوريات", "الطيور", "الثدييات"},
            {"برغش", "بعوضة", "تسي تسي", "زنباوية"},
            {"الصياح", "الضغيب", "الشحيج", "الضرضرة"},
            {"الحمامة", "الغراب", "الهدهد", "الكلب"},
            {"النغير", "التطوير", "الانسلاخ", "الانفصال"},
            {"البجع", "النعامة", "البومة", "البطريق"},
            {"لبود خروعي", "صفر خراطيني", "حريش بني", "دودة القز"},
            {"الغزال", "الزرافة", "الشمبانزي", "الغوريلا"},

            //100
            {"الأعشاب", "الفواكهة", "النباتات", "اللحوم"},
            {"12 إصبعاً", "14 إصبعاً", "16 إصبعاً", "18 إصبعاً"},
            {"الأعشاب", "الفواكهة", "النباتات", "اللحوم"},
            {"القمل", "النحل", "الذباب", "البعوض"},
            {"افريقيا", "اروبا", "أمريكا", "اسيا"},
            {"النمر", "التمساح", "الاسد", "الكلب"},
            {"الشم", "اللمس", "السمع", "النظر"},
            {"المكسيك", "استراليا", "الهند", "الصين"},
            {"20 يوماً", "22 يوماً", "24 يوماً", "26 يوماً"},
            {"إصبعان", "3 إصبع", "4 إصبع", "5 إصبع"}


    };
    public String correctAnswersAnimals [] = {

            //10
            "عواء", "الشبل", "زائير", "النعامة", "الطنان", "النعامة", "الثديات", "الحوت",
            "فرس النهر", "الجمل",

            //20
            "الأرنب", "الفيل", "الدب", "القط", "الأسد", "الفهد", "سمكة الحجر", "الغزال",
            "الفأر", "الشمبانزي",

            //30
            "السلحفاة", "30 قدماً", "سبع البحر", "الدولفين", "الأخطبوط", "النعامة",
            "الدعفل", "العنكبوت", "الذباب", "الشاهين",

            //40
            "الثعابين", "5 عيون", "البعوضة", "النمل", "الأرنب", "6 أرجل", "العنكبوت",
            "السحلية", "زمار", "42 سناً",

            //50
            "هديل", "قهقهه", "القرد", "الجندب", "دودة الأرض", "نهيق", "صهيل", "حنين",
            "نهيز", "الشبل",

            //60
            "مواء", "المهر", "نباح", "الجحش", "سليل", "البومة", "الأبيض", "ذئب",
            "ضب", "كلب",

            //70
            "طاووس", "قطاة", "الزرافة", "غراب", "نملة", "الديسم", "ذكر النعامة",
            "الصرصار", "صفير", "زقزقة",

            //80
            "الضبع", "أبو منشار", "رشا", "الذئاب", "فحيح", "22 شهراً", "الجراد",
            "النمر", "القرد", "الجمل",

            //900
            "الضفدع", "الخنزير", "القشريات", "تسي تسي", "الضغيب", "الهدهد",
            "الانسلاخ", "البجع", "دودة القز", "الزرافة",

            //100
            "الأعشاب", "18 إصبعاً", "الفواكهة", "القمل", "أمريكا", "التمساح",
            "النظر", "المكسيك", "20 يوماً", "إصبعان"



    };


    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return listQuestionsAnimals.length;
    }

    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = listQuestionsAnimals[a];
        return question;
    }

    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of miltip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceAnimals[index][num-1];
        return choice;
    }

    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswersAnimals[a];
        return answer;
    }
}
