package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 02/05/2018.
 */

public class ArtQuestions {

    public String listQuestionsArt [] = {

            //10
            "من أول من عرف السيرك ؟",
            " من الذي رسم اللوحة (( الموناليزا )) ؟",
            "من مؤلف الرواية العالمية البؤساء ؟",
            "أين توجد لوحة (( الموناليزا )) ؟",
            " ما اسم الشاعر الأموي الملقب ب الأخطل ؟",
            "من صاحب اللوحة الفنية (( عباد الشمس )) ؟",
            "أين توجد أكبر قاعة مسرح في العالم ؟",
            " في أي مهرجان تعطى جائزة الدب الذهبي ؟",
            "مسرحي فرنسي يعد أعظم الكلاسيكيين في الأدب عامة ؟",
            "ما جنسية الرسام العالمي بيكاسو ؟",

            //20
            "كم عدد السنفونيات التي ألفها بتهوفن ؟",
            "كم عدد المسرحيات التي كتبها شكسبير ؟",
            "الخنساء شاعرة عربية مخضرمة فقدت أبنائها الأربعة في معركة القادسية واحتسبتهم شهداء عند الله فما هو اسمها ؟",
            "فلم بطولة عادل إمام  و شرين ما هو ؟",
            " من هو أمير الشعراء ؟",
            " من هو الشاعر الذي قتله شعره ؟",
            " من هو شاعر الشعراء ؟",
            " من هو عميد الأدب العربي ؟",
            " كاتب مسرحي وكوميدي فرنسي يعتبر من أعظم الكوميديين في العالم على مر العصور ؟",
            " من هو الروائي العالمي مؤلف رواية ( الحرب و السلام ) ؟",

            //30
            "شاعر ايطالي اقتبس قصة الإسراء و المعراج في كتابه (( الكوميديا الإلهية )) ؟",
            " من هو الشاعر الانجليزي الذي كتب ملحمة الفردوس ؟",
            " شاعر فارسي اشتهر بالرباعيات فمن هو ؟",
            " ما هو الفن الذي تم استحداثه في الأندلس ؟",
            "من الشاعر القائل هذا البيت ـ بذا قضت الأيام ما بين أهلها مصائبُ قومٍ عند قومٍ فوائدُ ؟",
            " من الشاعر القائل هذا البيت ـ نَقــِّل فؤادك حيث شئت من الهوى ما الحب إلا للحـبــيب الأول كم منزلٍ فى الكون يألـفه الفـتـى وحـنـينه أبدًا لأول منـزل ؟",
            "من قائل القصيدة الآتية ـ أغـدًا ألقاك. ؟",
            "من قائل القصيدة الآتية ـ الأجنحة المتـكسِّرة. ؟",
            "من الذي ألف شخصية (جيمس بوند) ومتى ؟",
            " ما هو الاسم الحقيقي للمغني الشاب خالد ؟",

            //40
            " ما أسم أقدم مسلسل كرتوني ؟",
            " قي أي يلاد تعزف آلة الماريمبا (Marimba) .؟",
            " ما هي جنسية المغنية (ميلينا ميركوري) ؟",
            " من كاتب مسلسل الإنيمي (مغامرات توم سوير) ؟",
            " ما هي جنسية الرسام كونستانتين برانكوشي .؟",
            " في أي بلد تؤدى رقصة (الكيبانغ) .؟",
            " ما هي أول شركة سينما عربية ؟",
            " من أول من استخدم آلة (القيثارة) .؟",
            " وين موجود مهرجان (عزف الغيتار) .؟",
            " من الملقب بـ (عميد المسرح العربي) .؟",

            //50
            " ما هو فن (السامري ) ..؟",
            " من الذي أطلق لقب العندليب على عبدالحليم حافظ ؟",
            "أين نشأت رقصة الباليه لأول مرة  .؟",
            "من أخترع آلة الأكورديون الموسيقية .؟",
            "ماهو (الفن السادس) ،؟",
            "من الذي رسم لوحة (زنابق الماء) .؟",
            " ما الاسم الحقيقي للفنانة (صابرين) .؟",
            "ما الاسم الحقيقي للفنانة المصرية (فيفى عبده) .؟",
            "أين تقام (مسابقة جائزة توني للفنون) ..؟",
            "ماهي جنسية المغنية (سيلين ديون) ..؟",

            //60
            " من هم اول رسام كاريكاتور في العالم .؟",
            "من هو مخترع البيانو .؟",
            "أين يقع (متحف مارتا للفنون) .؟",
            "أين يقع مسرح (هيبودروم) ..؟",
            "أين يقام (مهرجان السامبا) ..؟",
            "من الذي رسم  لوحة (لاعبي الكوتشينة) .؟",
            " ماهي جنسية المغني الغربي (جيمس براون) .؟",
            "ماهي جنسية الموسيقار “إرنست جولد” .؟",
            "ماهو الأسم الحقيقي للفنانه (يسرا) .؟",
            "من كاتب قصيدة (حديث الروح) التي غنتها ام كلثوم  .؟",


            //70
            "من هو الرسام الذي عمل لوحة (الطفل الباكي) ..؟",
            "من هو الموسيقي العربي الملقب بموسيقار الاجيال ..؟",
            "أين يقع متحف الأرميتاج ..؟",
            "من يغني اغنية يا مربي طير الحمام ..؟",
            " من ملحن أغنية (غلبت الصالح) لأم كلثوم ..؟",
            " ما هو اول فيلم عربي في تاريخ السينماء ..؟",
            "ما جنسية الرسام ليوناردو دافنشي ..؟",
            " ماهي رقصة (التانجو) ..؟",
            " ماهو الموطن الأصلي لموسيقى الرومبا ..؟",
            "كم عدد الأوتار لآلة القانون ؟",

            //80
            " من مؤلف مقطوعة بحيرة البجع السمفونية  .؟",
            " ماأسم أول أغنية عرفت وانتشرت للفنان محمد عبده .؟",
            " من الموسيقي الذي وضع قوانين السيمفونية .؟",
            "من هو مخرج الفيلم الأمريكي «حديقة الديناصورات» .؟",
            "من الذي رسم لوحة (الفتاة النائمة) .؟",
            " متى توفي الفنان عبد الحليم حافظ .؟",
            " ماهي جنسية فنان التصوير الفوتوغرافي مان راي .؟",
            "اين ولد وعاش الرسام خوسيه كليمنتي أوروزكو .؟",
            " ما اسم الممثل صاحب شخصية (مستر بن) .؟",
            "ماالاسم الاصلي لرقصه الفلامنجؤ .؟",

            //90
            " كم عدد آلأفلآم آلتي مثلهآ الموسيقار (محمد عپد آلوهآپ) ؟",
            " من هي الفنانة التي كان يطلق عليها (سلطانة الطرب) ؟",
            " ماأصل كلمة موسيقى أو ميوزيك . ?",
            "من هو صاحب فكرة رسوم ميكي ماوس ؟",
            "من اول من رسم الحمامة كرمز للسلام ؟",
            " مالأسم الحقيقي لكوكب الشرق السيدة ام كلثوم .. ؟",
            "من أول من غنى هيجت ذكراك حبي ؟",
            " من هو الأديب العربي الذي نال جائزة نوبل للآداب عام 1988م ؟",
            "من صاحب قصيدة نهج البردة ؟",
            " من هو الشاعر الذي ترجم رباعيات الخيام للغه العربية ؟",

            //100
            " من هو شاعر النيل وشاعر الشباب ؟",
            "عام كم كان يعرض فيلم كرتون بيتي بوب .؟",
            "من مؤلف المسرحيات التالية: تاجر البندقية، الملك لير ، ماكبث ؟",
            "من صاحب الكتب التالية : سقط الزند ، لزوم ما لا يلزم ، رسالة الغفران ؟",
            "من رائد فن المقامات في الأدب العربي ؟",
            " من رائد القصه القصيرة في الأدب العالمي في العصر الحديث ؟",
            "من صاحب رواية الحرب والسلام ؟",
            "من هو شاعر القطرين ؟",
            "من هي الشاعرة صاحبة لقب شاعرة الطبيعة ؟",
            " من هو الشاعر الفلسطيني صاحب مسرحية ثورة الزنج ؟"

    };
    public String multipeChoiceArt [][] = {

            //10
            {"الرومان", "اليونانيون", "الصينين", "الفراعنة"},
            {"رافايللو", "ليوناردو دافينشى", "بيكاسو", "مايكلانجلو"},
            {"وليام شكسبير", "جون ميلتون", "فيكتور هيجو", "جورج إليوت"},
            {"متحف اركل", "متحف تورفالدسون", "متحف لندن", "متحف اللوفر"},
            {"أبو العتاهية", "أبو تمام", "أبو الطيب المتنبي", "غياث بن غوث"},
            {"ريمبرانت", "فان جوخ", "يوديت لايستر", "فرانتس مارك"},
            {"اليابان", "امريكا", "الصين", "الهند"},
            {"مهرجان برلين", "مهرجان الاوسكار", "مهرجان قرطاج", "مهرجان كان"},
            {"ديفيد بيرى", "ريتشارد الان", "سيريل بارا", "راسين"},
            {"الماني", "أسباني", "ايطالي", "فرنسي"},

            //20
            {"6 سنفونيات", "7 سنفونيات", "8 سنفونيات", "9 سنفونيات"},
            {"37 مسرحية", "38 مسرحية", "39 مسرحية", "40 مسرحية"},
            {"هند بنت عتبة", "صفية بنت ثعلبة", "هند بنت النعمان", "تماضر بنت عمرو"},
            {"هالو أمريكا", "زنقة الستات", "الوردة الحمراء", "جنة الشياطين"},
            {"أحمد فؤاد نجم", "أحمد شوقي", "أمل دنقل", "حمد رامي"},
            {"البحتري", "ابن الرومي", "أبو العلاء المعري", "أبو الطيب المتنبي"},
            {"امرؤ القيس", "حسان بن ثابت", "ابو نواس", "الاصمعي"},
            {"توفيق الحكيم", "نجيب محفوظ", "طه حسين", "محمود العقاد"},
            {"موريس بوكاي", "سالفيه اتشار", "أندريه شديد", "موليير"},
            {"تو لستوي", "اسحاق فيلشتينسكي", "بوريس أكونين", "بوريس بوليفوي"},

            //30
            {"بييترو أريتينو", "توركواتو تاسو", "نيشي فيندولا", "دانتي"},
            {"راسل براند", "ملتون", "بيت دورتي", "أنتوني برجس"},
            {"حسين سميعي", "رضا أصلان", "عمر الخيّام", "علي مراد فراشبندي"},
            {"الغناء", "التمثيل", "المسرح", "الموشحات"},
            {"امرؤ القيس", "الأعشى", "عنترة بن شداد", "أبو الطيب المتنبى"},
            {"أبو تمام", "لبيد بن ربيعة", "طرفة بن العبد", "أحمد شوقي"},
            {"حافظ إبراهيم", "الهادى آدم", "صلاح جاهين", "عباس العقاد"},
            {"نزار قبانى", "فاروق جويدة", "جبران خليل جبران", "أدونيس"},
            {"إيان فلمنغ", "آلان وارن", "رالف براون", "روبرت شو"},
            {"خالد كمال إبراهيم", "خالد حسن إبراهيم", "خالد احمد إبراهيم", "خالد حاجّ إبراهيم"},

            //40
            {"القط فيليكس", "أبطال الإنجاد", "الأقزام", "أدغال الديجيتال"},
            {"السنغال", "كينيا", "زيمبابوي", "زامبيا"},
            {"اسبانية", "يونانية", "ايطالية", "فرنسية"},
            {"مارك توين", "مارفن كابلان", "مايا أنجيلو", "مايكل كريستوفر"},
            {"الماني", "روماني", "صيني", "ياباني"},
            {"ميانمار", "إندونيسيا", "ماليزيا", "سنغافورة"},
            {"إيزيس فيلم", "الشركة العربية", "فوكس سينما", "السبكى"},
            {"الإغريق", "الفراعنة", "البابليون", "السومريين"},
            {"النرويج", "الدنمارك", "فنلندا", "السويد"},
            {"توفيق الحكيم", "فاروق خورشيد", "يوسف وهبي", "يوسف إدريس"},

            //50
            {"فلكلور خليجي", "فلكلور اروبي", "فلكلور ياباني", "فلكلور افريقي"},
            {"جلال عامر", "حمدي قنديل", "خالد الكيلاني", "جليل البندارى"},
            {"ايطاليا", "النمسا", "بريطانيا", "فرنسا"},
            {"كريستيان فريدريش", "برونو بول", "جان آرب", "رشاد سليم"},
            {"فن الغناء", "فن المسرح", "الأدب والشعر", "فن التمثيل"},
            {"كلود لورين", "كلود مونيه", "جان بول ألو", "ويليام بوغيرو"},
            {"صابرين احمد", "صابرين خالد", "صابرين نادر", "صابرين ياسين"},
            {"عطيات عبد الفتاح", "فايزة خليل", "سمية احمد", "بدرية سلامة"},
            {"استراليا", "كندا", "الممكة المتحدة", "الولايات المتحدة"},
            {"مغنية برازيلية", "مغنية كندية", "مغنية فرنسية", "مغنية امريكية"},

            //60
            {"الإيطاليين", "البريطانين", "الالمانيين", "الفرنسيين"},
            {"برونو موناري", "بارتولوميو", "بييرو مانزوني", "روبرت مايلز"},
            {"سويسرا", "كندا", "ألمانيا", "فرنسا"},
            {"نيويورك", "شيكاغو", "ميامي", "واشنطون"},
            {"الباراغواي", "البرازيل", "المكسيك", "الارجنتين"},
            {"بول سيزان", "بول سينياك", "بيار بوشارل", "تشارلز أنغراند"},
            {"كولومبيا", "جورجيا", "روسيا", "جمايكا"},
            {"سامية محمد حافظ", "سمية محمد حافظ", "سميرة محمد حافظ", "سيفين محمد حافظ"},
            {"امريكى", "اسكتلندي", "ايرلندي", "نمساوي"},
            {"التجاني يوسف بشير", "أبو القاسم الشابي", "محمد اقبال", "صلاح جاهين"},

            //70
            {"مايكل أنجلو", "جيوفاني براغولين", "أنطونيو كانوفا", "جبر علوان"},
            {"محمد عبد الوهاب", "فريد الأطرش", "عبد الحليم حافظ", "رامي صبري"},
            {"روسيا", "السويد", "اوكرانيا", "فرنسا"},
            {"اني العمري", "محمد سلمان", "نبيل أبو مراد", "طوني حنا"},
            {"سيد درويش", "فريد الأطرش", "رياض السنباطي", "هاني شنودة"},
            {"فيلم ليلى", "قبلة في الصحراء", "البحر بيضحك", "تحت سماء مصر"},
            {"فرنسي", "اسباني", "الماني", "ايطالي"},
            {"الارجنتين", "البرتغال", "المكسيك", "البرازيل"},
            {"جمايكية", "صينية", "كوبية", "سنغالية"},
            {"70 وتراً", "71 وتراً", "72 وتراً", "73 وتراً"},

            //80
            {"بيوتر تشايكوفسكي", "تونى كاريرا", "تيتوف", "تيرى شافاوزر"},
            {"الهوى الغايب", "خاصمت عيني", "وحدك", "أنشودة المطر"},
            {"جوليا فيشر", "دافيد غاريت", "رالف بينشو", "جوزيف هايدن"},
            {"تشاك جونز", "تشارلز لوتون", "ستيفن ألان سبيلبرغ", "ارنست طومسون"},
            {"رالف باكشي", "روي ليختنشتاين", "رون كليمنتس", "ريبيكا شوغر"},
            {"مارس / 1974", "مارس / 1975", "مارس / 1976", "مارس / 1977"},
            {"الولايات المتحدة", "المملكة المتحدة", "فرنسا", "المانيا"},
            {"مكسيكي", "تيشيكي", "امريكي", "برازيلي"},
            {"أوين يومان", "روان أتكينسون", "بيتر فينش", "تيموثي دالتون"},
            {"رومانيا", "فرنسا", "اسبانبا", "ايطاليا"},

            //90
            {"4 أفلام", "5 أفلام", "6 أفلام", "7 أفلام"},
            {"منيرة المهدية", "ميرفت أمين", "ميرفت عفيفي", "مارجريت نخلة"},
            {"يونانية", "فرنسية", "انجليزية", "لاتينية"},
            {"آل ليتسون", "آدم داريوس", "والت ديزني", "والاس شون"},
            {"سلفادور دالي", "مانويل ريفيرا", "إديجر نيبيه", "بابلو بيكاسو"},
            {"خديجة أبراهيم", "فاطمة أبراهيم", "عايشة أبراهيم", "امنة أبراهيم"},
            {"عبد الله محمد", "خالد السلامة", "رابح صقر", "راشد الماجد"},
            {"توفيق الحكيم", "أنيس منصور", "طه حسين", "نجيب محفوظ"},
            {"أحمد شوقي", "حافظ إبراهيم", "أحمد فؤاد نجم", "أمل دنقل"},
            {"صلاح جاهين", "أحمد رامي", "فاروق جويدة", "هشام الجخ"},

            //100
            {"حافظ ابراهيم", "فؤاد حداد", "الصاوي شعلان", "إبراهيم ناجي"},
            {"عام 1930م", "عام 1931م", "عام 1932م", "عام 1933م"},
            {"أوليفيا شكسبير", "توماس شادويل", "جيمس تاونلي", "وليم شكسبير"},
            {"الجاحظ", "أبو العلاء", "الفرزدق", "البحتري"},
            {"بديع الزمان", "أبو فراس الحمداني", "ابن الرومي", "بشار بن برد"},
            {"ليونيد أندرييف", "دانييل غرانين", "تشيكوف", "مكسيم غوركي"},
            {"ليو تولستوي", "ليونيد ليونوف", "ميخائيل بولغاكوف", "ميخائيل شولوخوف"},
            {"خليل مطران", "إيليا أبو ماضي", "ميخائيل نعيمة", "أحمد مطر"},
            {"نازك الملائكة", "عائشة التيمورية", "فدوى طوقان", "مي زيادة"},
            {"تميم البرغوثي", "محمود درويش", "سميح القاسم", "معين بسيسو"}

    };
    public String correctAnswerArt [] = {

            //10
            "الرومان", "ليوناردو دافينشى", "فيكتور هيجو", "متحف اللوفر", "غياث بن غوث",
            "فان جوخ", "الصين", "مهرجان برلين", "راسين", "أسباني",

            //20
            "9 سنفونيات", "37 مسرحية", "تماضر بنت عمرو", "هالو أمريكا", "أحمد شوقي",
            "أبو الطيب المتنبي", "امرؤ القيس", "طه حسين", "موليير", "تو لستوي",

            //30
            "دانتي", "ملتون", "عمر الخيّام", "الموشحات", "أبو الطيب المتنبى", "أبو تمام",
            "الهادى آدم", "جبران خليل جبران", "إيان فلمنغ", "خالد حاجّ إبراهيم",

            //40
            "القط فيليكس", "زيمبابوي", "يونانية", "مارك توين", "روماني", "ماليزيا",
            "إيزيس فيلم", "السومريين", "فنلندا", "يوسف وهبي",

            //50
            "فلكلور خليجي", "جليل البندارى", "ايطاليا", "كريستيان فريدريش", "الأدب والشعر",
            "كلود مونيه", "صابرين ياسين","عطيات عبد الفتاح", "الولايات المتحدة", "مغنية كندية",

            //60
            "الإيطاليين", "بارتولوميو", "ألمانيا", "نيويورك", "البرازيل",
            "بول سيزان", "جورجيا", "سيفين محمد حافظ", "امريكى", "محمد اقبال",

            //70
            "جيوفاني براغولين", "محمد عبد الوهاب", "روسيا", "محمد سلمان", "رياض السنباطي",
            "فيلم ليلى", "ايطالي", "الارجنتين", "كوبية", "72 وتراً",

            //80
            "بيوتر تشايكوفسكي", "خاصمت عيني", "جوزيف هايدن", "ستيفن ألان سبيلبرغ", "روي ليختنشتاين",
            "مارس / 1977", "الولايات المتحدة", "مكسيكي", "روان أتكينسون", "اسبانبا",

            //90
            "7 أفلام", "منيرة المهدية", "يونانية", "والت ديزني", "بابلو بيكاسو", "فاطمة أبراهيم",
            "عبد الله محمد", "نجيب محفوظ", "أحمد شوقي", "أحمد رامي",

            //100
            "حافظ ابراهيم", "عام 1930م", "وليم شكسبير", "أبو العلاء", "بديع الزمان", "تشيكوف",
            "ليو تولستوي", "خليل مطران", "عائشة التيمورية", "معين بسيسو"

    };


    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return listQuestionsArt.length;
    }


    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = listQuestionsArt[a];
        return question;
    }


    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of miltip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceArt[index][num-1];
        return choice;
    }


    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswerArt[a];
        return answer;
    }

}
