package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 30/04/2018.
 */

public class CapitalQuestions {

    public String ListQuestionsCapital [] = {

            //10
            " ماهي عاصمة افغانستان ؟",
            " ماهي عاصمة البانيا ؟",
            " ماهي عاصمة الجزائر ؟",
            " ماهي عاصمة اندورا ؟",
            " ماهي عاصمة أنغولا ؟",
            " ماهي عاصمة الارجنتين ؟",
            " ماهي عاصمة أرمينيا ؟",
            " ماهي عاصمة استراليا ؟",
            " ماهي عاصمة النمسا ؟",
            " ماهي عاصمة اذربيجان ؟",

            //20
            " ماهي عاصمة البحرين ؟",
            " ماهي عاصمة بنجلاديش ؟",
            " ماهي عاصمة بلجيكا ؟",
            " ماهي عاصمة البوسنة والهرسك ؟",
            " ماهي عاصمة البرازيل ؟",
            " ماهي عاصمة بلغاريا ؟",
            " ماهي عاصمة بوركينا فاسو ؟",
            " ماهي عاصمة الكاميرون ؟",
            " ماهي عاصمة تشاد ؟",
            " ماهي عاصمة الصين ؟",

            //30
            " ماهي عاصمة كولمبيا ؟",
            " ماهي عاصمة جزر الُقمـــر ؟",
            " ماهي عاصمة جمهورية الكونغو ؟",
            " ماهي عاصمة كوستاريكا ؟",
            " ماهي عاصمة كوت ديفوار ؟",
            " ماهي عاصمة كرواتيا ؟",
            " ماهي عاصمة كوبا ؟",
            " ماهي عاصمة قبرص ؟",
            " ماهي عاصمة جمهورية التشيك ؟",
            " ماهي عاصمة الدنمارك ؟",

            //40
            " ماهي عاصمة الاكوادور ؟",
            " ماهي عاصمة مصر ؟",
            " ماهي عاصمة فنلندا ؟",
            " ماهي عاصمة فرنسا ؟",
            " ماهي عاصمة المانيا ؟",
            " ماهي عاصمة غانا ؟",
            " ماهي عاصمة اليونان ؟",
            " ماهي عاصمة غينيا ؟",
            " ماهي عاصمة المجر ؟",
            " ماهي عاصمة الهند ؟",

            //50
            " ماهي عاصمة اندونيسيا ؟",
            " ماهي عاصمة ايران ؟",
            " ماهي عاصمة العراق ؟",
            " ماهي عاصمة ايرلندا ؟",
            " ماهي عاصمة ايطاليا ؟",
            " ماهي عاصمة جاميكا ؟",
            " ماهي عاصمة اليابان ؟",
            " ماهي عاصمة الاردن ؟",
            " ماهي عاصمة كازاخستان ؟",
            " ماهي عاصمة كينيا ؟",

            //60
            " ماهي عاصمة كوريا الشمالية ؟",
            " ماهي عاصمة كوريا الجنوبية ؟",
            " ماهي عاصمة ُلبنان ؟",
            " ماهي عاصمة ليبيريا ؟",
            " ماهي عاصمة ليبيا ؟",
            " ماهي عاصمة مقدونيا ؟",
            " ماهي عاصمة ماليزيا ؟",
            " ماهي عاصمة مالى ؟",
            " ماهي عاصمة موريتانيا ؟",
            " ماهي عاصمة منغوليا ؟",

            //70
            " ماهي عاصمة المغرب ؟",
            " ماهي عاصمة موزمبيق ؟",
            " ماهي عاصمة ميانمار (بورما) ؟",
            " ماهي عاصمة نيبال ؟",
            " ماهي عاصمة هولندا ؟",
            " ماهي عاصمة النيجر  ؟",
            " ماهي عاصمة نيجيريا ؟",
            " ماهي عاصمة النرويج ؟",
            " ماهي عاصمة سلطنة عًمان ؟",
            " ماهي عاصمة باكستان ؟",

            //80
            " ماهي عاصمة بيرو ؟",
            " ماهي عاصمة الفلبين ؟",
            " ماهي عاصمة بولندا ؟",
            " ماهي عاصمة البرتغال ؟",
            " ماهي عاصمة رومانيا ؟",
            " ماهي عاصمة السنغال ؟",
            " ماهي عاصمة سيراليون ؟",
            " ماهي عاصمة جنوب افريقيا ؟",
            " ماهي عاصمة إسبانيا ؟",
            " ماهي عاصمة سريلانكا ؟",

            //90
            " ماهي عاصمة السودان ؟",
            " ماهي عاصمة السويد ؟",
            " ماهي عاصمة تنزانيا ؟",
            " ماهي عاصمة تايلاند ؟",
            " ماهي عاصمة اوغندا ؟",
            " ماهي عاصمة فنزويلا ؟",
            " ماهي عاصمة فيتنام ؟",
            " ماهي عاصمة اليمن ؟",
            " ماهي عاصمة زامبيا ؟",
            " ماهي عاصمة زيمبابوى ؟",

            //100
            " ماهي عاصمة الامارات العربية المتحدة ؟",
            " ماهي عاصمة الولايات المتحدة الامريكية ؟",
            " ماهي عاصمة الصومال ؟",
            " ماهي عاصمة السعودية ؟",
            " ماهي عاصمة رواندا ؟",
            " ماهي عاصمة مالاوى ؟",
            " ماهي عاصمة ليتوانيا ؟",
            " ماهي عاصمة هايتى ؟",
            " ماهي عاصمة اريتريا ؟",
            " ماهي عاصمة المملكة المتحدة ؟"


    };
    public String multipeChoiceCapital [][] = {

            //10
            {"كابول", "إسلام آباد", "كاتماندو", "كولمبو"},
            {"تالين", "تيرانا", "تبليسي", "توشهافن"},
            {"عنابة", "وهران", "الجزائر", "قسنطينة"},
            {"كانيلو", "انكامب", "أوردينو", "أندورا لا فيلا"},
            {"هوامبو", "لواندا", "لوبيتو", "بنغيلا"},
            {"لابلاتا", "ريسيستينسيا", "روسون", "بوينس ايرس"},
            {"غيومري", "يريفان", "فانادزور", "هرازدان"},
            {"سيدني", "كانبرا", "ملبورن", "بريزبان"},
            {"فيينا", "فادوتس", "فاليتا", "فيلنيوس"},
            {"كنجه", "سومقاييت", "لانكاران", "باكو"},

            //20
            {"المنامة", "المحرق", "الحد", "الرفاع"},
            {"شيتاغونغ", "كولنا", "نارايانجانج", "دكا"},
            {"براتيسلافا", "بالتسي", "بريشتينا", "بروكسل"},
            {"ستوكهولم", "سوخومي", "سراييفو", "فادوتس"},
            {"ساو باولو", "برازيليا", "ريو دي جانيرو", "سالفادو"},
            {"صوفيا", "كارديف", "نيقوسيا", "تبليسي"},
            {"ويندهوك", "دودوما", "واغادوغو", "مامودزو"},
            {"ياموسوكرو", "ياوندي", "بيساو", "برايا"},
            {"نجامينا", "نواكشوط", "نيامي", "نيروبي"},
            {"شانغهاي", "هونغ كونغ", "بكين", "تيانجين"},

            //30
            {"بوغوتا", "ليتيسيا", "ميديلين", "أروكا"},
            {"موروني", "مونروفيا", "مامودزو", "مبابان"},
            {"بانغي", "برازافيل", "بريتوريا", "بوجومبورا"},
            {"سان سلفادور", "سان خوان", "سانت جورجز", "سان خوسيه"},
            {"أبيدجان", "أنتاناناريفو", "أبوجا", "كامبالا"},
            {"ريغا", "ريكيافيك", "زغرب", "نيقوسيا"},
            {"هافانا", "ماناغوا", "رود تاون", "هاميلتون"},
            {"نوك", "نيقوسيا", "مينسك", "ليوبليانا"},
            {"برن", "براتيسلافا", "بالتسي", "براغ"},
            {"كارديف", "كوبنهاغن", "كيشيناو", "كييف"},

            //40
            {"كاراكاس", "كايين", "كيتو", "كينغستون"},
            {"القاهرة", "الإسكندرية", "الجيزة", "المنصورة"},
            {"هلسنكي", "فادوتس", "فاليتا", "فيلنيوس"},
            {"برشلونة", "بلفاست", "برلين", "باريس"},
            {"همبورغ", "برلين", "ميونخ", "فرانكفورت"},
            {"أنتاناناريفو", "سمرة", "أكرا", "أبيدجان"},
            {"أثينا", "سالونيك", "بيرايوس", "باتراي"},
            {"كوتونو", "كوناكري", "كيب تاون", "كيغالي"},
            {"بودابست", "بودغوريتسا", "بوخارست", "بلفاست"},
            {"مومباي", "تشيناي", "دلهي", "كلكتا"},

            //50
            {"جاكرتا", "بوخارا", "بيشكك", "طشقند"},
            {"طهران", "مشهد", "كرج", "أصفهان"},
            {"الموصل", "البصرة", "أربيل", "بغداد"},
            {"دبلن", "ستانة", "إسكوبية", "ليوبليانا"},
            {"ميلانو", "روما", "فلورنسا", "البندقية"},
            {"كينغستون", "كايين", "كاراكاس", "كيتو"},
            {"يوكوهاما", "أوساكا", "طوكيو", "ناغويا"},
            {"الزرقاء", "عمان", "إربد", "الرصيفة"},
            {"إسلام آباد", "أولان باتور", "كاتماندو", "استانة"},
            {"نيروبي", "نيامي", "نواكشوط", "انجمينا"},

            //60
            {"بيشكك", "بنوم بنه", "بوخارا", "بيونغيانغ"},
            {"سري جايا", "سنغافورة", "سول", "سوخومي"},
            {"بيروت", "طرابلس", "صيدا", "صور"},
            {"مالابو", "منروفيا", "ماسيرو", "مابوتو"},
            {"بنغازي", "طرابلس", "سرت", "الزاوية"},
            {"سكوبى", "سوخومي", "دوشنبه", "دييغو غارسيا"},
            {"كاتماندو", "كوالالمبور", "كولمبو", "كابل"},
            {"ريتوريا", "بورت لويس", "باماكو", "بيساو"},
            {"هراري", "هرجيسا", "ويندهوك", "نواكشوط"},
            {"أولان باتور", "ماليه", "أنقرة", "عشق آباد"},

            //70
            {"الدار البيضاء", "الرباط", "فاس", "مراكش"},
            {"ماسيرو", "مالابو", "مامودزو", "مابوتو"},
            {"نايبيداو", "ميكتيلا", "مولمين", "رانغونا"},
            {"كاتماندو", "خانكندي", "بيشكك", "كاتماندو"},
            {"أكوريري", "أمستردام", "أندورا لا فيلا", "أوسلو"},
            {"مقديشو", "ليلونغوي", "نيامى", "لومي"},
            {"ابوجا", "أبيدجان", "فريتاون", "فونشال"},
            {"سراييفو", "اوسلو", "مينسك", "تبليسي"},
            {"عدن", "صلالة", "مسقط", "السيب"},
            {"عشق آباد", "طشقند", "تايبيه", "اسلام اباد"},

            //80
            {"لاباز", "بوغوتا", "باراماريبو", "ليما"},
            {"ماليه", "مانيلا", "هانوي", "يريفان"},
            {"يريفان", "مينسك", "وارسو", "ريغا"},
            {"لشبونة", "لوكسمبورغ", "ليوبليانا", "تالين"},
            {"بريشتينا", "بلفاست", "بوخارست", "بودابست"},
            {"داكار", "تفاريتي", "دودوما", "ليبرفيل"},
            {"فونشال", "فريتاون", "فيكتوريا", "غابورون"},
            {"جوهانسبرغ", "كيب تاون", "ديربان", "بريتوريا"},
            {"برشلونة", "مدريد", "إشبيلية", "مالقة"},
            {"كولومبو", "كاتماندو", "نايبيداو", "نيقوسيا"},

            //90
            {"بورتسودان", "الخرطوم", "ود مدني", "كردفان"},
            {"ستوكهولم", "سراييفو", "سانتياغو", "سوكري"},
            {"ليلونغوي", "ليبرفيل", "لومي", "دار السلام"},
            {"بنوم بنه", "نانجينغ", "بانكوك", "نايبيداو"},
            {"كمبالا", "كوتونو", "كوناكري", "كيغالي"},
            {"كيشيناو", "كراكاس", "كايين", "كيتو"},
            {"هلسنكي", "هراري", "هانوى", "هرجيسا"},
            {"عدن", "حضرموت", "صنعاء", " تعز"},
            {"لوساكا", "لوبامبا", "لواندا", "ليبرفيل"},
            {"هرجيسا", "نيروبي", "هراري", "ياوندي"},

            //100
            {"أبوظبي", "دبي", "الشارقة", "رأس الخيمة"},
            {"نيويورك", "كاليفورنيا", "لوس أنجلوس", "واشنطن"},
            {"مقديشو", "جوبا", "بلومفونتين", "كوتونو"},
            {"المدينة المنورة", "مكة", "الرياض", "جدة"},
            {"كينشاسا", "كيب تاون", "كوناكري", "كيغالي"},
            {"ليلونجو", "لواندا", "لوساكا", "ليبرفيل"},
            {"فادوتس", "فاليتا", "فيلنيوس", "فيينا"},
            {"بورتو برنس", "هافانا", "بريدج تاون", "ماناغوا"},
            {"ديس أبابا", "أبيدجان", "أسمرة", "أنتاناناريفو"},
            {"مانشستر الكبرى", "كامبريدجشير", "أكسفوردشير", "لندن الكبرى"}


    };
    public String correctAnswerCapital [] = {

            //10
            "كابول", "تيرانا", "الجزائر", "أندورا لا فيلا", "لواندا", "بوينس ايرس",
            "يريفان", "كانبرا", "فيينا", "باكو",

            //20
            "المنامة", "دكا", "بروكسل", "سراييفو", "برازيليا", "صوفيا", "واغادوغو",
            "ياوندي", "نجامينا", "بكين",

            //30
            "بوغوتا", "موروني", "برازافيل", "سان خوسيه", "أبيدجان", "زغرب", "هافانا",
            "نيقوسيا", "براغ", "كوبنهاغن",

            //40
            "كيتو", "القاهرة", "هلسنكي", "باريس", "برلين", "أكرا", "أثينا","كوناكري",
            "بودابست", "دلهي",

            //50
            "جاكرتا", "طهران", "بغداد", "دبلن", "روما", "كينغستون", "طوكيو", "عمان",
            "استانة", "نيروبي",

            //60
            "بيونغيانغ", "سول", "بيروت", "منروفيا", "طرابلس", "سكوبى", "كوالالمبور",
            "باماكو", "نواكشوط","أولان باتور",

            //70
            "الرباط", "مابوتو", "نايبيداو", "كاتماندو", "أمستردام", "نيامى", "ابوجا",
            "اوسلو", "مسقط", "اسلام اباد",

            //80
            "ليما", "مانيلا", "وارسو", "لشبونة", "بوخارست", "داكار", "فريتاون",
            "بريتوريا", "مدريد", "كولومبو",

            //90
            "الخرطوم", "ستوكهولم", "دار السلام", "بانكوك", "كمبالا", "كراكاس", "هانوى",
            "صنعاء", "لوساكا", "هراري",

            //100
            "أبوظبي", "واشنطن", "مقديشو", "الرياض", "كيغالي", "ليلونجو", "فيلنيوس",
            "بورتو برنس", "أسمرة", "لندن الكبرى"

    };



    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return ListQuestionsCapital.length;
    }


    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = ListQuestionsCapital[a];
        return question;
    }


    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of miltip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceCapital[index][num-1];
        return choice;
    }


    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswerCapital[a];
        return answer;
    }

}
