package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 10/05/2018.
 */

public class GeneralQuestions {


    public String listQuestionsGeneral [] = {

            //10
            " قال الصحابة رضي الله عنهم عن الحزب الذي أوله سورة (ق) بأنه الحزب ..؟",
            "البلاد التي عرفت بالعربية السعيده هي بلاد ..؟",
            "قال تعالى ( وَالذَّارِيَاتِ ذَرْوًا ) المقصود بالذاريات في الآية ...؟",
            "أكمل المثل العربي القائل (تفرقوا أيدي ...)؟",
            "تولى أبو سفيان بن حرب قيادة المشركين في غزوة ..؟",
            " نشأت الدولة الصليحية عام 439هـ - 1045م في مدينة ..؟",
            "الميناء التجاري الرئيسي في دولة الكويت هو ميناء..؟",
            "من هو صاحب القصيدة التي جاء في مطلعها : سَأعيشُ رَغْمَ الدَّاءِ والأَعْداءِ *** كالنِّسْر فوقَ القِمَّة ِ الشَّمَّاءِ ؟",
            "من هو صاحب لقب محيي السنة؟",
            "في أي دولة توجد قلعة الركيات ؟",

            //20
            "أول من صنف الحديث الصحيح هو الإمام ..؟",
            "ما أسم أم الرسول صلى الله عليه وسلم؟",
            "الصحابي الذي كان يعذبه أمية بن خلف في مكة وكان يقول أحد أحد هو ...؟",
            "الجهاز الذي تُختبَر به مقاومةُ المواد للاحتكاك هو مختبر..؟",
            "العالم  الالماني رودولف هو مخترع ..؟",
            "الكوكب الذي طول العام فيه 84سنة أرضية...هو كوكب..؟",
            "اللغة الثانية التي يتكلمها الشعب الجزائري هي اللغة ..؟",
            "الخليفة الذي كان يحج عام ويغزو عام هو ..؟",
            "طعام الزائر يسمى ... ؟",
            "من الدول التي لها حدود برية مع دولة أنجولا دولة..؟",

            //30
            "أول مئذنة شيدة في الإسلام هي مئذنة الجامع الأموي في مدينة  ..؟",
            "العالم العربي المسلم أبو الحسن علي بن الحسين المسعودي يعتبر من علماء المسلمين في علم..؟",
            "من الدول التي لها حدود برية مع دولة بليز دولة ...؟",
            " من الأصنام التي عبدها قوم نوح صنم ...؟",
            "المادة التى تزيد من سرعة التفاعل الكيميائى تسمى..؟",
            "قال تعالى ( فَالْجَارِيَاتِ يُسْرًا ) المقصود بالجاريات في الآية هي ..؟",
            "محافظة الفروانية هي من محافظات دولة ... ؟",
            "ورد لفظ البعير مرتان في القرآن الكريم في سورة...؟",
            "ما هي العقوبة الحدية التي شرعها القرآن الكريم لمن يقذف المحصنات؟",
            "من العالم الذي لقب فيلسوف العرب؟",

            //40
            "من المعارك التي قاد فيها أبو عبيدة الثقفي جيش المسلمين موقعة ..؟",
            "أسم الملك خازن النار هو ؟",
            "أين ولد أحمد ديدات ؟",
            "كانت عاصمة الخلافة العثمانية مدينة.... ؟",
            "جزيرة موشي هي من الجزر التابعة لدولة..؟",
            "زعيم يهود بني قريظة هو..؟",
            "أخر من يموت من الملائكة هو ..؟",
            "المرض الذي تنقله إلى الإنسان أنثى البعوض(الأنوفوليس) هو مرض ..؟",
            "عرف الشاعر جميل بن عبد الله بن معمر العذري القضاعي بـ جميل ...؟",
            "أبو الضيفان هو سيدنا ..؟",

            //50
            "خطيب الأنبياء هو نبي الله سيدنا..؟",
            "من الأصنام التي عبدها قوم نوح صنم ...؟",
            "من الصحابي الذي عرف بـ ( بليع الأرض )؟",
            "أبو الأنبياء هو نبي الله سيدنا ..؟",
            "الناموس الأكبر هو ..؟",
            "الجديدان هما..؟",
            "الداران هما..؟",
            "من الدول التي لها حدود برية مع دولة أرمينيا دولة ...؟",
            "الثقلان هما ..؟",
            "أول النبت يسمى..؟",

            //60
            "أول سيف شهر في الإسلام هو سيف..؟",
            " كليم الله عزوجل هو رسول الله ..؟",
            "أول من صام هو نبي الله ..؟",
            "ذو النورين هو..؟",
            "حجة الإسلام هو..؟",
            "مدينة تاجورة هي من مدن دولة ..؟",
            "ديوان (شجر الليل ) من دوواين الشاعر المصري ..؟",
            "أول الجيش يسمى..؟",
            "في أي دولة توجد محافظة الدقهلية؟",
            "أسد الصحراء هو..؟",

            //70
            "جالينوس العرب هو..؟",
            "المعلم الثاني هو..؟",
            "من مؤلفات الشيخ محمد بن سيرين كتاب..؟",
            "معجزة الأدب العربي هو..؟",
            "أول المطر يسمى..؟",
            "سلطان العلماء هو..؟",
            "أين توجد مدينة أغادير؟",
            "اذا كان الرجل مشقوق الشفة السفلى فيقال أنه ...؟",
            "النبي الذي بعثه الله مع أخيه هارون إلى فرعون هو ..؟",
            " من هو صاحب كتاب عيون التواريخ؟",

            //80
            "كم جاءت كلمة (الوسيلة)في القرآن الكريم؟",
            "صوت الحُلى يسمى..؟",
            "باحثة البادية هي..؟",
            "من هو صاحب كتاب هداية العارفين؟",
            "ما هو الودق؟",
            "أين توجد مدينة ديجون ؟",
            "من هو صاحب كتاب شذرات الذهب ؟",
            "في أي قارة يوجد نهر درينا؟",
            "ولد الرسول صلى الله عليه وسلم في شعب ...؟",
            "من العشرة المبشرين بالجنة الصحابي ...؟",

            //90
            "أين يوجد جامع القرويين؟",
            "من اهم المدن في دولة الجزائر مدينة ..؟",
            "كان يسمى ملوك اليمن قبل الإسلام بالأذواء و...؟",
            "من مؤلفات قاضي القضاة أبو يوسف يعقوب بن إبراهيم الأنصاري كتاب ..؟",
            "شهيدة العشق الإلهي هي..؟",
            "أين دفنت أم المؤمنين عائشة بنت أبي بكر رضى الله عنها؟",
            "من القائل:- أنا القطران والشعراء جربى*** وفي القطران للجربى شفاء؟",
            "في أي قارة يوجد جبل كيلي مانجرو؟",
            "ماذا تعني كلمة الغسق؟",
            "ما هو العنصر الأساسي الموجود في الشمس؟",

            //100
            "ماذا يطلق على الإنسان الذي تكون عيناه صغيرتا جداً؟",
            "ابن الدب يسمى ...؟",
            "لقب علي بن ابي طالب رضى الله عنه بـ...؟",
            "الإحليل من أجزاء الجهاز ...؟ ",
            "كم مدة تولى أنور السادات رئاسة جمهورية مصر العربية؟",
            "ما هو المعجم العربي الذي ألفه الخليل بن أحمد الفراهيدي؟",
            "ثمود هم قوم نبي الله...؟",
            "من هو الصحابي المستجاب الدعاء ؟",
            "قوم عاد هم قوم نبي الله ...؟",
            "من الصحابي الذي سمع الرسول دف نعليه بالجنة؟"

    };
    public String multipeChoiceGeneral [][] = {

            //10
            {"المقطع", "الكامل", "المفصل", "المجزأ"},
            {"اليمن", "العراق", "مصر", "الاردن"},
            {"الملائكة", "الريح", "الجن", "الخيول"},
            {"قتبان", "معين", "حمير", "سبأ"},
            {"بدر", "أحد", "الخندق", "تبوك"},
            {"جبله", "تعز", "زبيد", "صنعاء"},
            {"الشويخ", "الأحمدي", "الشعيبة", "الدوحة"},
            {"البارودي", "أحمد شوقي", "الزبيري", "الشابي"},
            {"الشافعي", "انس بن مالك", "أحمد بن حنبل", "أبو حنيفة"},
            {"قطر", "البحرين", "الكويت", "الامارات"},

            //20
            {"مسلم", "البخاري", "مالك", "الترمذي"},
            {"حليمه السعديه", "زينب بنت أميه", "أمنة بنت وهب", "فاطمة بنت أسد"},
            {"زيد بن حارثة", "عمار بن ياسر", "ياسر بن عامر", "بلال بن رباح"},
            {"السَّحْج", "السفيح", "المحك", "الحكيك"},
            {"الرادار", "محرك الديزل", "الآله البخاريه", "محرك السياره"},
            {"أورانوس", "نبتون", "المشتري", "زحل"},
            {"الايطاليه", "الاسبانيه", "الكرديه", "الفرنسية"},
            {"عمر بن عبدالعزيز", "عبدالملك بن مروان", "هارون الرشيد", "أبو جعفر المنصور"},
            {"التحفة", "الخُرس", "العقيقه", "الوليمه"},
            {"تشاد", "زامبيا", "ليبيا", "تونس"},

            //30
            {"بغداد", "القاهره", "دمشق", "المغرب"},
            {"الطب", "الجغرافيا", "التاريخ", "الفقه"},
            {"الارجنتين", "المكسيك", "السلفادور", "هندوراس"},
            {"اللات", "يغوث", "بعل", "هبل"},
            {"مسرع", "مزيد", "مفاعل", "مُعَجِّل"},
            {"السفن", "السحب", "الرياح", "الكواكب"},
            {"قطر", "الامارات", "الكويت", "جيبوتي"},
            {"يوسف", "الأنعام", "البقرة", "الأنبياء"},
            {"الرجم", "السجن", "الجلد", "النفي"},
            {"الكندي", "الخوارزمي", "ابن الهيثم", "ابن زهر"},

            //40
            {"اليرموك", "القادسية", "اليمامه", "الجسر"},
            {"مالك", "رضوان", "عتيق", "جبريل"},
            {"ماليزيا", "اندونيسيا", "جنوب أفريقيا", "الهند"},
            {"أنقره", "بغداد", "انطاليا", "اسطنبول"},
            {"جيبوتي", "الصومال", "ارتيريا", "اليمن"},
            {"حييى بن أخطب", "كعب بن أسد", "كعب بن الحارث", "الحارث بن كعب"},
            {"جبريل", "اسرافيل", "عزرائيل", "ميكائيل"},
            {"الملاريا", "النوم", "السعال", "التيفوس"},
            {"بثيره", "جليله", "بثينه", "ليلى"},
            {"يوسف", "إبراهيم", "يعقوب", "إسماعيل"},

            //50
            {"نوح", "إبراهيم", "شعيب", "محمد"},
            {"ود", "مناة", "العزى", "هبل"},
            {"مصعب بن عمير", "حسان بن ثابت", "عبدالله بن رواحه", "خبيب بن عدي"},
            {"أدم", "إبراهيم", "يعقوب", "نوح"},
            {"إسرافيل", "عزرائيل", "جبريل", "ميكائيل"},
            {"الشمس والقمر", "الدنيا والأخرة", "الليل والنهار", "المشرق والمغرب"},
            {"الدنيا والأخرة", "مكه والمدينه", "الأرض والسماء", "المغرب والمشرق"},
            {"باكستان", "الهند", "إيران", "أذريبجان"},
            {"الجبلان", "الشمس والقمر", "الإنس والجن", "الحيوان والطير"},
            {"البارض", "النابت", "البكور", "الباكوره"},

            //60
            {"سعد بن أبي وقاص", "الزبير بن العوام", "عبدالله بن جحش", "حمزة"},
            {"محمد", "هارون", "عيسى", "موسى"},
            {"نوح", "إبراهيم", "يعقوب", "داود"},
            {"أبو بكر الصديق", "عمر بن الخطاب", "عثمان بن عفان", "علي بن أبي طالب"},
            {"ابن تيميه", "العز بن عبد السلام", "الغزالي", "ابن القيم"},
            {"باكستان", "جيبوتي", "تونس", "الجزائر"},
            {"أحمد شوقى", "توفيق زياد", "صلاح عبدالصبور", "تركي عامر"},
            {"الطليعه", "السريه", "الكتيبة", "الواجهه"},
            {"العراق", "مصر", "ليبيا", "السودان"},
            {"عبدالقادر الجزائري", "صدام حسين", "عمر المختار", "عبدالخالق حسونه"},

            //70
            {"الرازي", "الخوازمي", "إبن سينا", "إبن رشد"},
            {"أرسطو", "الرازي", "الفارابي", "إبن سينا"},
            {"الروئ والأحلام", "تفسير الروئ", "تفسير الروئ والأحلام", "تفسير الأحلام"},
            {"طه حسين", "مصطفى العقاد", "حافظ إبراهيم", "مصطفى صادق الرفاعي"},
            {"المزن", "الوسمي", "الرشيش", "الغيث"},
            {"أحمد بن تيميه", "ابن قيم الجوزيه", "العز بن عبدالسلام", "بو حامد الغزالي"},
            {"الجزائر", "المغرب", "تونس", "السودان"},
            {"أفلح", "أشفر", "أشتر", "أشج"},
            {"عيسى", "زكريا", "يحيى", "موسى"},
            {"ابن الجزري", "ابن فرحون", "ابن شاكر الكتبي", "ابن العماد"},

            //80
            {"مرتان", "خمس مرات", "سبع مرات", "تسع مرات"},
            {"الحسيس", "الفحيح", "الصنين", "السِّواس"},
            {"فدوى طوقان", "ملك حفني ناصف", "نازك الملائكه", "فضيله شوقي"},
            {"الشرابيني", "البغدادي", "المكي", "اليافعي"},
            {"السحاب", "الضباب", "المطر", "الدخان"},
            {"إيطاليا", "المانيا", "بريطانيا", "فرنسا"},
            {"ابن العماد", "ابن شاكرالكتبي", "ابن الجزري", "ابن فرحون"},
            {"أوربا", "استراليا", "أفريقيا", "أمريكا الجنوبية"},
            {"بني هاشم", "بني المطلب", "بني كلاب", "بني مناف"},
            {"عمار بن ياسر", "عبدالله بن رواحه", "سعيد بن زيد", "زيد بن حارثه"},

            //90
            {"الرباط", "طنجة", "مراكش", "فاس"},
            {"عنابة", "الغدير", "الكوفه", "سوسة"},
            {"الكياسره", "الأقيال", "القياصره", "البطارقه"},
            {"النهل", "العين", "الصداق", "الخراج"},
            {"فاطمة الخراز", "بدويه الياس", "رابعة العدوية", "سميه بنت خياط"},
            {"البقيع", "مكه", "الكوفه", "دمشق"},
            {"الأخطل", "جرير", "الفرزدق", "أبو نواس "},
            {"أسيا", "استراليا", "أوربا", "أفريقيا"},
            {"العصر", "المغرب", "العشاء", "الفجر"},
            {"النتروجين", "الكالسيوم", "الهيدروجين", "البوتاسيوم"},

            //100
            {"الاعمش", "الارقش", "لاطرش", "الأخفش"},
            {"الديسم", "الرأل", "الهيثم", "الغيثم"},
            {"الصادق البار", "الطيار", "أبي تراب", "ذي الشهادتين"},
            {"البولي", "التنفسي", "الدوري", "الهظمي"},
            {"خمس سنوات", "تسع سنوات", "إحدى عشر سنة", "ثلاثة عشر سنة"},
            {"الصحاح", "العين", "العرب", "المصباح"},
            {"صالح", "شعيب", "هود", "ادريس"},
            {"عثمان بن عفان", "سعد بن أبي وقاص", "زيد بن حارثة", "الزبير بن العوام"},
            {"هود", "لوط", "سليمان", "ايوب"},
            {"عمر بن الخطاب", "معاذ بن جبل", "بلال بن رباح", "ابو بكر الصديق"}


    };

    public String correctAnswersGeneral [] = {

            //10
             "المفصل", "اليمن", "الريح", "سبأ", "أحد", "صنعاء", "الشويخ", "الشابي",
             "أحمد بن حنبل", "قطر",

            //20
            "البخاري", "أمنة بنت وهب", "بلال بن رباح", "السَّحْج", "محرك الديزل",
            "أورانوس", "الفرنسية", "هارون الرشيد", "التحفة", "زامبيا",

            //30
            "دمشق", "الجغرافيا", "المكسيك", "يغوث", "مُعَجِّل", "السفن", "الكويت",
            "يوسف", "الجلد", "الكندي",

            //40
            "الجسر", "مالك", "جنوب أفريقيا", "اسطنبول", "جيبوتي", "كعب بن أسد",
            "عزرائيل", "الملاريا", "بثينه", "إبراهيم",

            //50
            "شعيب", "ود", "خبيب بن عدي", "إبراهيم", "جبريل", "الليل والنهار", "الدنيا والأخرة",
            "أذريبجان", "الإنس والجن", "البارض",

            //60
            "عبدالله بن جحش", "موسى", "نوح", "عثمان بن عفان", "الغزالي", "جيبوتي",
            "صلاح عبدالصبور", "الطليعه", "مصر", "عمر المختار",

            //70
            "الرازي", "الفارابي", "تفسير الأحلام", "مصطفى صادق الرفاعي", "الوسمي",
            "العز بن عبدالسلام", "المغرب", "أفلح", "موسى", "ابن شاكر الكتبي",

            //80
            "مرتان", "السِّواس", "ملك حفني ناصف", "البغدادي", "المطر", "فرنسا", "ابن العماد",
            "أوربا", "بني المطلب", "سعيد بن زيد",

            //90
            "فاس", "عنابة", "الأقيال", "الخراج", "رابعة العدوية", "البقيع", "الفرزدق",
            "أفريقيا", "العشاء", "الهيدروجين",

            //100
            "الأخفش", "الديسم", "أبي تراب", "البولي", "إحدى عشر سنة", "العين", "صالح",
            "سعد بن أبي وقاص", "هود", "بلال بن رباح"



    };


    // Method return numbers - in the same order as array of questions
    public int getLength() {
        return listQuestionsGeneral.length;
    }

    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = listQuestionsGeneral[a];
        return question;
    }

    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of miltip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceGeneral[index][num-1];
        return choice;
    }

    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswersGeneral[a];
        return answer;
    }


}
