package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 29/04/2018.
 */

public class GeographicQuestions {


    public String ListQuestionGeographic [] = {

            //10
            " كم عدد الجزر الرئيسية في جزر القمر ؟",
            " ما أسم أكبر جزيرة في الكويت ؟",
            " في أي الدول العربية يوجد نهر الأعوج والديراني ؟",
            " ما هو أطول نهر في لبنان ؟",
            " كم عدد الدول العربية في قارة آسيا ؟",
            "  ما هي الدولة العربية التي يمر بها خط الاستواء ؟",
            " على أي نهر تقع مدينة بغداد ؟",
            "  ما هي العاصمة الخليجية الوحيدة التي لا تطل على بحر ؟",
            "  كم عدد الولايات في الولايات المتحدة الأمريكية ؟",
            "  ما هي الدولة التي تسمى الدولة الهيلينية ؟",

            //20
            "  كم دولة لها حدود برية مع الصين ؟",
            "  ما هي عاصمة أذربيجان ؟",
            "  ما هي عاصمة اريتريا ؟",
            "  ما هي عاصمة الأورجواي ؟",
            "  ما هي عاصمة البارجواي ؟",
            "  ما هو عدد المدن التي تحمل أسم القاهرة في العالم ؟",
            "   كم عدد الدول التي تطل على البحر الأحمر بتفرعاته ؟",
            "  ما هي أكبر بحيرة في العالم ؟",
            "   ما هو ثاني أكبر بحر في العالم ؟",
            "  ما هي القارة التي لا تطل على المحيط الأطلسي ؟",

            //30
            "  ما هو عدد الدول العربية التي تطل على البحر الأبيض المتوسط ؟",
            "  أين يوجد مركز حلــف شمـال الأطلنــطي ؟",
            "  ما هي أكبر بحيرة في قارة أفريقيا ؟",
            "  ما أسم المضيق الذي يصل بين البحر الأحمر وخليج عدن ؟",
            "  في أي دولة يوجد مضيق ماجلان ؟",
            "  ما أسم القناة التي تصل بين المحيط الأطلسي والمحيط الهادي ؟",
            "   ما هي اكبر جزيرة مساحة في العالم ؟",
            "   في أي دولة يوجد أكبر عدد من الجزر ؟",
            "  في أي دولة توجد شلالات إنجل ؟",
            "  ما هو النهر الملقب بنهر العواصم ؟",

            //40
            "  من أي دولة ينبع نهر الأمازون ؟",
            "  ما هي أطول سلسلة جبلية في العالم ؟",
            "   ما هي أعلى قمة في العالم ؟",
            "  ما أسم السلسلة الجبلية التي تفصل بين أسبانيا وفرنسا ؟",
            "  ما هي الدولة التي تضع خريطتها على علمها ؟",
            "   ما هي أعلى هضبة في العالم ؟",
            "   ما هو اكبر خليج في العالم ؟",
            "   ما هو أطول أنهار أوربا ؟",
            "   ما هو أقرب كوكب إلى الشمس ؟",
            "   ما هي اصغر دولة في العالم ؟",

            //50
            " ما هي أكثر دول العالم انتاجا للفول السوداني ؟",
            " على أي مدينة يطلق مدينة الشمس ؟",
            " ما أسم البناء الوحيد الذي يمكن رؤيته من الفضاء ؟",
            "  ما أعلى قمة جبل في الوطن العربي ؟",
            "  ما هو أكبر ميناء في العالم ؟",
            "  ما هي أكبر دولة يوجد بها فوسفات في العالم ؟",
            " أين يوجد أكبر عدد من البراكين في العالم ؟",
            " كم تستغرق الارض لتكمل دورة كاملة حول محورها ؟",
            " ما هو البحر الذي يفصل بين قارتين ويقع بين بحرين ؟",
            " ما هي أغنى دولة في العالم أنتاجا للصمغ ؟",

            //60
            " أين يوجد المقـر الرسمــي للأوبيـــــك ؟",
            "أين يوجد بـــرج إيفـــــــل ؟",
            " أين يوجد أكبـــــــر هَــــــرَم في العالم ؟",
            " ما هو الاسم الحالي لروديســـــيا ؟",
            " ما هو أكثر الأنهــــار غـــزارة ؟",
            " ما هي أكبر مدينة من المدن الأوروبية ؟",
            " ما هي شبة جزيرة في شبة جزيرة وتقع بجوارها جزر ؟",
            " اين توجد غابات الاطلس وهى الاكبر من نوعها في العالم العربي ؟",
            " ما هي الدولة التي تتكون من مجموعة من الجزر تشبه الهلال ؟",
            " اين يوجد أطول جسر معلق في العالم ؟",

            //70
            " ما هو أبرد مكان علي سطح الأرض ؟",
            " فى أى عام تم تحديد خط الطول جرينتش كمقياس لخطوط الطول الأخرى ؟",
            " عاصمة قديمة للشام ايام البزنطيين ؟",
            " ما هو الكوكب الاحمر ؟",
            " اين يوجد أول متحف للشمع في العالم ؟",
            " ما هو البلد العربي الدى كان يسمى افريقيا ؟",
            " مدينة تاريخية قريبة من مكة المكرمة ال ….. ؟",
            " أين يوجد جامع القيروان في المغرب ؟",
            " ماهي القناة البحرية التي تربط بين البحر المتوسط والبحر الأحمر ؟",
            " ما هي أكبر دولة في قارة أمريكا الجنوبية ؟",

            //80
            " ما أكبر دولة في العالم من حيث المساحة ؟",
            " ما هي أقدم دولة تنتج البخور و اللبان في العالم ؟",
            " اى المدن السعودية تطل على الخليج العربى ؟",
            " ما اصغر دولة أوروبية ؟",
            " اين يوجد مسجد اياصوفيا ؟",
            " أين قامت دولة الموحدين ؟",
            " من أي الدول تنبع الانهار الثلاثة التالية الدانوب – الرون – الرين ؟",
            " على أي البلاد اطلق لقب جوهرة الإمبراطورية البريطانية ؟",
            " أين توجد أطول سكة حديد في العالم ؟",
            " ماهو النهر الوحيد في العالم ينبع من الجنوب إلى الشمال ؟",

            //90
            " ماهي اللغه الرسميه للبرازيل ؟",
            " ما هو البحر الذي يفصل بين تركيا واليونان ؟",
            " ما هي أثقل مادة في الكرة الأرضية ؟",
            " اين توجد مدينه طرواده المشهوره في التاريخ ؟",
            " ما اسم الجبل الذي تتكي علية مدينة المكلا في اليمن السعيد ؟",
            " أين يوجد مقر منظمة الوحدة الأفريقية ؟",
            " ماهي العاصمة الأوروبية التي تقع على ملتقى نهري أمستل والإيجل ؟",
            " أين يوجد معبد الكرنك ؟",
            " ماهي عاصمة ولاية كنتاكي الأمريكية ؟",
            " ماهي أكثر دولة مستوردة للكهرباء ؟",

            //100
            " أين يوجد أكبر تجمع للخيول في العالم ؟",
            " أين يوجد نهر خور بركة ؟",
            " أين يوجد مقر البنك الدولي ؟",
            " ماهي المدينة التي يعني اسمها الجبل الأبيض ؟",
            " ماهي أكثر القوميات المتواجدة في الأردن من غير العرب ؟",
            " ماهي أكبر جزر الأنتيل ؟",
            " ماهو الميناء الذي يقع على فوهة بركان ؟",
            " في أي مدينة توجد المأذنة الملوية ؟",
            " ماهي الجزيرة التي تقاس بها أكبر سرعة رياح ؟",
            " ما معنى أذربيجان ؟"

    };

    public String multipeChoiceGeographic [][] = {

            //10
            {"4 جزر", "5 جزر", "6 جزر", "7 جزر"},
            {"جَزِيرَة وَرْبَة", "جَزِيرَة بُوبِيَان", "جَزِيرَة مِسْكَان", "جَزِيرَة عَوْهَة"},
            {"لبنان", "الاردن", "العراق", "سوريا"},
            {"نهر العاصي", "نهر الحاصباني", "نهر الليطاني", "نهر الزهراني"},
            {"10 دولة", "11 دولة", "12 دولة", "13 دولة"},
            {"السودان", "الصومال", "الجزائر", "السعودية"},
            {"نهر دجلة", "نهر الفرات", "نهر الدجيل", "نهر ديالى"},
            {"الرياض", "المنامة", "الدوحة", "ابوظبي"},
            {"51 ولاية", "50 ولاية", "53 ولاية", "54 ولاية"},
            {"الباراجواي", "بوليفيا", "اليونان", "بلغاريا"},

            //20
            {"11 دولة", "12 دولة", "13 دولة", "14 دولة"},
            {"طشقند", "باكو", "فيينتيان", "كابل"},
            {"هراري", "ياموسوكرو", "أسمره", "أديس أبابا"},
            {"لاباز وسوكري", "مونتيفيدو", "سانتياغو", "بوغوتا"},
            {"أسنسيون", "ستانلي", "غريتفيكن", "بوغوتا"},
            {"8 مدينة", "12 مدينة", "14 مدينة", "18 مدينة"},
            {"6 دول", "7 دول", "8 دول", "9 دول"},
            {"ماراكايبو", "بحيرة سوبيريور", "بحيرة قزوين", "بحيرة تنجانيقا"},
            {"البحر الكاريبي", "البحر الأدرياتيكي", "البحر الأسود", "البحر الأحمر"},
            {"اروبا", "افريقيا","امريكا", "آسيا"},

            //30
            {"6 دول", "7 دول", "8 دول", "9 دول"},
            {"باريس", "برلين", "امستردام", "بروكسل"},
            {"بحيرة تانجانيكا", "بحيرة ملاوى", "بحيرة كيوجا", "بحيرة فيكتوريا"},
            {"باب المندب", "باب السلام", "مضيق جوهور", "مضيق تيران"},
            {"المكسيك", "تشيلي", "الارجنتين", "البرازيل"},
            {"قناة ألبرت", "قناة أجيم", "قناة بنما", "قناة تيتشفيلد"},
            {"جرينلاند", "جزيرة بنغهو", "سانتوريني", "الكناري"},
            {"اليابان", "أندونيسيا", "الصين", "الهند"},
            {"النرويج", "الدنمارك", "فنزويلا", "انجلترا"},
            {"نهر الميسيسيبي", "نهر الراين", "نهر السند", "نهر الدانوب"},

            //40
            {"الإكوادور", "كولومبيا", "سورينام", "بيرو"},
            {"جبال الهمالايا", "جبال الألب", "جبال الأنديز", "جبال ألوتيان"},
            {"جبل دينالي", "جبل إفرست", "جبل كليمنجارو", "جبل كوسيياسكو"},
            {"جبال البرانس", "جبال الألب", "جبال الأبينيني", "جبال الأورال"},
            {"صربيا", "هنغاريا", "قبرص", "رومانيا"},
            {"هضبة التبت", "هضبة الأناضول", "هضبة الدكن", "الهضبة اللورنسية"},
            {"الخليج العربي", "خليج عمان", "خليج كاليفورنيا", "خليج المكسيك"},
            {"نهر الأورال", "الدانوب", "نهر الرون", "السين"},
            {"الزهرة", "المريخ", "المشترى", "عطارد"},
            {"الفاتيكان", "موناكو", "ناورو", "توفالو"},

            //50
            {"السودان", "الهند", "الصين", "امريكا"},
            {"بعلبك", "قرطاجة", "طرابلس", "الخرطوم"},
            {"الاهرامات", "سور الصين", "برج الخليفة", "برج ايفل"},
            {"جبل دماوند", "جبال رونزوري", "جبل طبقال", "جبال الأبالاش"},
            {"مينا شنغهاي", "ميناء روتردام", "ميناء سنغافورة", "ميناء نيويورك"},
            {"ايران", "المغرب", "جنوب افريقيا", "الجزائر"},
            {"سيريلانكا", "أندونيسيا", "السنغال", "إثيوبيا"},
            {"1440 دقيقة", "1450 دقيقة", "1460 دقيقة", "1470 دقيقة"},
            {"البحر الاحمر", "البحر الأبيض", "البحر الأسود", "بحر الشمال"},
            {"نيجيريا", "السودان", "الكاميرون", "موزمبيق"},

            //60
            {"فيــنَّا", "لندن", "دبلن", "موسكو"},
            {"لندن", "مدريد", "باريس", "روما"},
            {"الارجنتين", "السودان", "مصر", "المكسيك"},
            {"غانا", "زيمبابوي", "اوغندا", "كينيا"},
            {"الميسيسيبي", "نهر النيل", "الأمازون", "الدَّانوب"},
            {"جنيف", "لندن", "باريس", "روما"},
            {"الامارات", "البحرين", "السعودية", "قطر"},
            {"موريتانيا", "المغرب", "تونس", "ليبيا"},
            {"الجزائر", "جيبوتي", "جزر القمر", "البحرين"},
            {"انجلترا", "السعودية", "امريكا", "النرويج"},

            //70
            {"روسيا", "منغوليا", "الصين", "سيبيريا"},
            {"عام 1881 م", "عام 1882 م", "عام 1883 م", "عام 1884 م"},
            {"انطاكية", "حمص", "حلب", "حماة"},
            {"الزهرة", "المريخ", "المشتري", "نبتون"},
            {"باريس", "أثينا", "ستوكهولم", "أوسلو"},
            {"السودان", "ليبيا", "تونس", "جيبوتي"},
            {"الطائف", "القصيم", "الجوف", "الباحة"},
            {"مراكش", "فاس", "أغادير","طنجة"},
            {"قناة أجيم", "قناة ألبرت", "قناة السويس", "قناة إيري"},
            {"الأرجنتين", "البرازيل", "الإكوادور", "الباراغواي"},

            //80
            {"الصين", "استراليا", "كندا", "روسيا"},
            {"الصومال", "عمان", "اليمن", "الأردن"},
            {"الخرج", "الجبيل", "الأحساء", "الدمام"},
            {"النمسا", "بلجيكا", "هولندا", "سويسرا"},
            {"تركيا", "العراق", "فلسطين", "الكويت"},
            {"الجزائر", "مصر", "المغرب", "العراق"},
            {"ألمانيا", "سويسرا", "فرنسا", "إسبانيا"},
            {"جنوب افريقيا", "استراليا", "امريكا", "الهند"},
            {"كندا", "اليابان", "الصين", "كوريا"},
            {"نهر النيل", "نهر النيجر", "نهر الكونغو", "نهر السنغال"},

            //90
            {"الاسبانية", "الفرنسية", "الانجليزية", "البرتغاليه"},
            {"بحر أندامان", "بحر إيجة", "بحر أندامان", "بحر البلطيق"},
            {"الفضة", "الماس", "اليورانيوم", "الذهب"},
            {"تركيا", "أذربيجان", "التشيك", "أوكرانيا"},
            {"جبل النبي شعيب", "جبل نقم", "جبل صبر", "جبل القارة"},
            {"أديس أبابا", "كينيا", "الكاميرون", "النيجر"},
            {"روما", "لشبونة", "أمستردام", "كوبنهاغن"},
            {"الجيزة", "الفيوم", "قنا", "دمياط"},
            {"فرانكفورت", "أدير", "ألين", "أنديرسون"},
            {"كولومبيا", "الأوروغواي", "الباراغواي", "البيرو"},

            //100
            {"جزر فوكلاند", "جزر كايمان", "جزر بيتكيرن", "جزر كايمان"},
            {"تشاد", "إريتريا", "تانزانيا", "مدغشقر"},
            {"واشنطن", "تكساس", "فلوريدا", "نيويورك"},
            {"براغ", "برن", "بلغراد", "بودابست"},
            {"الأرمن", "الكرد", "الشيشان", "الشراكسة"},
            {"كوبا", "جامايكا", "هايتي", "هسبانيولا"},
            {"عدن", "كراتشي", "يانغون", "سيبولغا"},
            {"الموصل", "سامراء", "البصرة", "النجف"},
            {"جزيرة جاوة", "جزيرة سولاوسي", "جزيرة ملوكي", "جزيرة سومطرة"},
            {"أرض اللهب", "أرض الخير", "أرض النار", "الأرض الجميلة"}


    };

    public String correctAnswersGeographic [] ={

            //10
            "4 جزر", "جَزِيرَة بُوبِيَان", "سوريا", "نهر الليطاني", "12 دولة", "الصومال",
            "نهر دجلة", "الرياض", "50 ولاية", "اليونان",

            //20
            "14 دولة", "باكو", "أسمره", "مونتيفيدو", "أسنسيون", "18 مدينة", "7 دول",
            "بحيرة قزوين", "البحر الكاريبي", "آسيا",

            //30
            "8 دول", "بروكسل", "بحيرة فيكتوريا", "باب المندب", "تشيلي", "قناة بنما",
            "جرينلاند", "أندونيسيا", "فنزويلا", "نهر الدانوب",

            //40
            "بيرو", "جبال الأنديز", "جبل إفرست", "جبال البرانس", "قبرص", "هضبة التبت", "خليج المكسيك",
            "الدانوب", "عطارد", "الفاتيكان",

            //50
            "الهند", "بعلبك", "سور الصين", "جبل طبقال", "ميناء نيويورك", "المغرب", "أندونيسيا",
             "1440 دقيقة", "البحر الاحمر", "السودان",

            //60
            "فيــنَّا", "باريس", "المكسيك", "زيمبابوي", "الأمازون", "لندن", "قطر", "المغرب",
            "جزر القمر", "انجلترا",

            //70
            "سيبيريا", "عام 1884 م", "انطاكية", "المريخ", "باريس", "تونس", "الطائف",
            "فاس", "قناة السويس", "البرازيل",

            //80
            "روسيا", "الصومال", "الجبيل", "سويسرا", "تركيا", "المغرب", "سويسرا", "الهند"
            , "كندا", "نهر النيل",

            //90
            "البرتغاليه", "بحر إيجة", "اليورانيوم", "تركيا", "جبل القارة",
            "أديس أبابا", "أمستردام", "قنا", "فرانكفورت", "الأوروغواي",

            //100
            "جزر فوكلاند", "إريتريا", "واشنطن", "بلغراد", "الشراكسة", "هايتي", "عدن",
            "سامراء", "جزيرة ملوكي", "أرض اللهب"


    };


    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return ListQuestionGeographic.length;
    }


    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = ListQuestionGeographic[a];
        return question;
    }


    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of miltip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceGeographic[index][num-1];
        return choice;
    }


    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswersGeographic[a];
        return answer;
    }

}
