package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 28/04/2018.
 */

public class HistoryQuestions {

    public String ListQuestionHistory [] = {

            //10
            " متى تم منح أول جائزة نوبل في العالم ؟",
            " ما أسم أول جريدة عربية ؟",
            " ما أول مدينة بناها المسلمون خارج الجزيرة العربية ؟",
            " أين ومتى حفر أول بئر للنفط بالعالم ؟",
            " كم سنة بين بناء المسجد الحرام والمسجد الاقصى ؟",
            "  ماذا سميت القمة الرابعة عشرة التي أنعقدت في الرياض ؟",
            " من هو أول شخص دار حول الكرة الارضية ؟",
            " متى وضع الانسان قدمه على القمر لأول مرة ؟",
            " ما هي أقدم لغة مكتوبة في العالم ؟",
            " متى تم أتحاد دولة الامارات العربية المتحدة ؟",


            //20
            " من هو القائد الأموي الذى رفض محاربة سيدنا( علي بن أبى طالب ) في معركةصفين ؟",
            " ماهي اللغة التي كان يتكلمها المسيح عليه السلام ؟",
            " ما أقدم مدينة في العالم ومازالت مأهولة بالسكان وبالحياة حتى الآن. ؟",
            " ما المعركة التي انتصر فيها الظاهر بيبرس على تيمورلنك ؟",
            " بنى الامبراطور شاهجهان تاج محل كمقبرة لزوجته وبعد وفاته دُفِن معها فماذا كان اسم زوجته. ؟",
            " فى عام 1915م عزل الإنجليز الخديوى عباس حلمى الثانى فمن هو السلطان الذى عينه الإنجليز مكانه. ؟",
            " ما اسم عاصمة مصر الفرعونية فى عهد المملكة القديمة. ؟",
            " كم عدد المحلفين الذين حاكموا سقراط وحكموا عليه بالإعدام عام 399 (ق.م). ؟",
            " من هو السلطان العثمانى الذى عُـرف بالجهاد فى سبيل الله وفتح (صوفيا) وبلاد (البوسنة) وتولى العرش عام 1362م ؟",
            " من أول من ظهرت صورته على طابع بريد (من غير الملوك ). ؟",

            //30
            " من هو أول من رسم الخرائط الجغرافيه ؟",
            "  في أ ي سنة بدء التاريخ الهجري ؟",
            " من هو أول من حصل على لقب سيد الشهداء ؟",
            " ما أول معركه قادها الامام علي (ع) ضد مخالفيه ؟",
            " ماذا كانت تسمى البحرين قديما ؟",
            " من هو أول من لقب بقاضي القضاه في الاسلام ؟",
            " من هي اكبر حرب عالميه ؟",
            "  من هي عاصمه الدوله العباسيه ؟",
            " كم كانت حكومة بني أميه ؟",
            " بماذا سمي عرب الشمال قديما ؟",

            //40
            " متى قامت الحرب بين الولايات المتحدة والمكيسك. ؟",
            " ممن اشترت أمريكا ولاية لويزيانا ؟",
            " أين صدر أول طابع حكومي في العالم ؟",
            " ما العاصمة السابقة لروسيا قبل موسكو. ؟",
            " من أول رئيس أمريكي كاثوليكي (حيث أن كل الرؤساء السابقين له كانوا من البروتستانت منذاستقلال أمريكا ). ؟",
            " كان السواد شعارالعباسيين واللون الأخضر شعارالفاطميين فماذاكان لون شعار العثمانيين. ؟",
            " ما اسم المعركة التي هَزَم فيها العباسيون الأُمَويين وأخذوامنهم الحكم عام 132 هـ . ؟",
            " متى قامت معركة العالمين. ؟",
            " من هو الزعيم الذي قاد الثورة في المغرب ضد الاستعمار الفرنسي. ؟",
            " متى هاجم الطيران الياباني القاعدة البحرية الأمري, (بيرل هاربور) وألحقت بها خسائر فادحة وبسببها دخلت أمريكا الحرب. ؟",

            //50
            " متى تم افتتاح حديقة حيوانات الجيزة. ؟",
            " فى أى عام بدأ الحكم النازى ؟",
            " قوانين حامورابي الشهيرة هي أقدم قوانين ظهرت على وجه الأرض فأين توجد هذه القوانين حاليًا. ؟",
            " من كان يحكم مصر وقت مجىء سيدنا يوسف عليه السلام إلى مصر. ؟",
            " متى تُوفى الزعيم أحمد عرابى. ؟",
            " ( ما أعظم الفنان الذى يخسره العالم بموتى ) .. من قائل هذه العبارة. ؟",
            " متى انشئت مدينة روما ؟",
            " بين من قامت حرب المائة عام ؟",
            "  ما هى أول مدينة أنشأها المسلمون بالمغرب ؟",
            " متى بدأ إرسال الإذاعة المصرية. ؟",

            //60
            "  متى وُلِـد سعد زغلول ؟",
            " من هو الملك الفرعونى الذى قام ببناء أبى الهول. ؟",
            " ما اسم المعركة التى انتصر فيها أوكتافيوس على أنطونيو وكليوباترا ؟",
            " فى أى عام احتلت الدولة العثمانية مصر. ؟",
            " متى توفى صلاح الدين الأيوبى ؟",
            " متى سُمح لليهود بالعودة إلى مملكة (يهوذا) بعد الأسر البابلى ؟",
            " متى أنشئت السوق الأوروبية المشتركة. ؟",
            " ما اسم المدينة التى وُلِدَ بها سيدنا عيسى عليه السلام. ؟",
            " ما هو تاريخ بدأ العدوان الأنجلو أمريكية على العراق ؟",
            " متى وقع صلح الحديبية ؟",

            //70
            " متى وقعت مذبحة صبرا وشاتيلا بالميلادي ؟",
            " الروسي يوري هو أول رائد فضاء فمتى كان ذلك ؟",
            " متى قامت أمريكا بأول رحلة فضائية ؟",
            "  متى تنازل الحسين رضي الله عنه بالخلافة لمعاوية رضي الله عنه ؟",
            " متى ولد الحسين بن علي رضي الله عنهما ؟",
            " متى كانت غزوة خيبر ؟",
            " ما هي المعركة التي سماها المسلمون فتح الفتوح ؟",
            " ما هي أول دولة خليجية ظهر فيها البترول سنة 1932 م ؟",
            "  بدات الخلافه العثمانيه سنه(1517م) فمتى انتهت ؟",
            " ماهو الاسم القديم للصين ؟",

            //80
            " ماهي عاصمه الجمهوريه العربيه اليمنيه قبل صنعاء ؟",
            "  في أي عام قامت أول بطوله كاس العالم بكرة القدم ؟",
            " من هو أول من أستعمل شوكه الطعام ؟",
            " من هم أول من أطلقوا تسميه الطبيب البيطري ؟",
            " من هو بطل كاس العالم في عام 1966 ؟",
            " كم سنه حكمت فكتوريا برطانيا ؟",
            " من هي الدوله التي أستضافت كاس العالم لعام 1998 ؟",
            " ماهو اقدم كتاب ديني عالمي ؟",
            " أين أفتتح اول متحف في العالم ؟",
            " ماأسم اقدم مكتبه في العالم الاسلامي ؟",

            //90
            " من هي أول دولة أستخدمت الطباعة ؟",
            " من هو اول قائد لحركه الشعب الفلسطيني ؟",
            " متى كانت أول حرب صليبيه في بيت المقدس ؟",
            " ماأسم أول غزوه للمسلمين ضد اليهود ؟",
            " من هو أول من ترجم القرآن إلى الاتينيه ؟",
            " من أول دولة أستخدمت التلفاز ؟",
            " من هم اول من قدموا الفديه للمسلمين ؟",
            " من هو أول من ادخل القطن في الطب ؟",
            " متى تأسست رياضه كره السله ؟",
            " من هم الذين نهبوا الحجر الاسود من مكه المكرمه ؟",

            //100
            "  ما أسم روسيا البيضاء قديما ؟",
            " من هو أول مبايع لابي بكر من الانصار ؟",
            " متى وقع اول زلزال في العالم ؟",
            " من اول رئيس للوزراء في الباكستان ؟",
            " من هو اول رئيس لامريكا ؟",
            " من استخدم مصطلح الانتفاضه لاول مره ؟",
            " من هو أول شخص صنع الكره الارضيه الجغرافيه ؟",
            " من اين بدات الثوره الاسلاميه في إيران ؟",
            " من كان قائد السلاح الجوي المصري في حرب 1973 ؟",
            "من هو أول من عرف أن سرعة الضوء أكبر من سرعة الصوت ؟"

    };

    public String multipeChoiceHistory [][] = {

            //10
            {"عام 1900م", "عام 1901م", "عام 1902م", "عام 1904م"},
            {"الاهرام المصرية", "الوقائع المصرية", "الراي القطرية", "عكاظ السعودية"},
            {"البصرة", "بغداد ", "دمشق", "حيفا"},
            {"السعودية", "قطر", "الكويت", "بنسلفانيا"},
            {"20 سنة", "30 سنة", "40 سنة", "50 سنة"},
            {"القدس لنا", "امة واحدة", "العرب اخوة", "الملفات الساخنة"},
            {"ماجلان البرتغالي", "كولومبوس الايطالي", "ابن بطوطة المغربي", "الإدريسي المغربي"},
            {"عام 1968م", "عام 1969م", "عام 1970م", "عام 1971م"},
            {"اللغة العربية", "اللغة الانجليزية", "اللغة الصينية", "اللغة الفرنسية"},
            {"عام 1970م", "عام 1971م", "عام 1972م", "عام 1973م"},


            //20
            {"أبو عبيد الثقفي", "موسى بن نصير", "عمرو بن العاص", "معاوية بن سفيان"},
            {"السومرية", "السريانية", "العبرية", "الآرامية"},
            {"دمشق", "فيحا", "أريحا", "القدس"},
            {"كركميش", "سيواس", "حماة", "مجدو"},
            {"ممتاز محل", "تاج محل", "نسرين", "زبيدة"},
            {"الخديوى اسماعيل", "حسين كامل", "الخديوى توفيق", "محمد على"},
            {"إيجيبتوس", "بنكين", "متزرايم", "ممفيس"},
            {"500 من المحلفين", "501 من المحلفين", "502 من المحلفين", "503 من المحلفين"},
            {"عُثمان الأوَّل", "أورخان", "مُراد الأوَّل", "بايزيد الأوَّل"},
            {"ويليام شكسبير", "بـلانـكارد", "بنيامين فرانكلين", "تومـــاس ســــانت"},

            //30
            {"ابو بكر الباقلاني", "ابو ريحان البيروني", "فخر الدين الرازي", "ابو المعالي الجويني"},
            {"580 م", "581 م", "582 م", "583 م"},
            {"حمزة بن عبد المطلب", "خالد بن الوليد", "الزبير بن العوام", "زيد بن حارثة"},
            {"معركة النهروان", "حرب الجمل", "معركة اليرموك", "معركة اليمامة"},
            {"المحرق", "جد حفص", "تيلوس", "سترة"},
            {"أبو الحكم الدمشقي", "أبو النصر التكريتي", "ابن ملكا البغدادي", "ابو يوسف القاضي"},
            {"الحروب الفارسية", "الحروب الصليبيه", "الحرب البرتغالية", "الحرب الموسكوية"},
            {"بغداد", "مكة", "الكوفة", "دمشق"},
            {"90 سنه", "91 سنه", "92 سنه", "93 سنه"},
            {"العدنانيين", "الساميون", "السبئيين", "القحطانيون"},

            //40
            {"عام 1845", "عام 1846", "عام 1847", "عام 1848"},
            {"انجلترا", "روسيا", "فرنسا", "اسبانيا"},
            {"المانيا", "السويد", "النمسا", "هولندا"},
            {"أباكان", "أبدولينو", "بطرسبرج", "بارابينسك"},
            {"جورج واشنطن", "جون كينيدي", "ابراهام لنكولن", "أندرو جاكسون"},
            {"الابيض", "الاحمر", "الاصفر", "القرمزى"},
            {"معركة الخازر", "معركة الزاب", "معركة العقر", "معركة كربلاء"},
            {"20 أكتوبر", "21 أكتوبر", "22 أكتوبر", "23 أكتوبر"},
            {"عبد الكريم الخطابي", "عبد السلام بن الطيب", "عبد الله الجراري", "عبد الله العروي"},
            {"عام 1940", "عام 1941", "عام 1942", "عام 1943"},

            //50
            {"عام 1890", "عام 1891", "عام 1892", "عام 1893"},
            {"عام 1931", "عام 1932", "عام 1933", "عام 1934"},
            {"المتحف البريطاني", "اللوفر", "متحف أورسيه", "متحف الإرميتاج"},
            {"كيليكيا", "ناڤارا", "نيقيا", "الهكسوس"},
            {"عام 1910م", "عام 1911م", "عام 1912م", "عام 1913م"},
            {"بيكاسو", "مايكل انجلو", "نـيـرون", "دافنشي"},
            {"عام 751 ق.م", "عام 752 ق.م", "عام 753 ق.م", "عام 754 ق.م"},
            {"انجلترا وفرنسا", "فرنسا و ايطاليا", "انجلترا و الهند", "المانيا و فرنسا"},
            {"الدار البضاء", "الرباط", "مراكش", "فاس"},
            {"عام 1931 م", "عام 1932 م", "عام 1933 م", "عام 1934 م"},

            //60
            {"عام 1855م", "عام 1856م", "عام 1857م", "عام 1858م"},
            {"أبيس", "خفرع", "آمون", "تحوت"},
            {"معركة قرقور", "معركة الفرما", "معركة أكتيوم", "معركة كركميش"},
            {"عام 1517م", "عام 1518م", "عام 1519م", "عام 1520م"},
            {"عام 1191 م", "عام 1192 م", "عام 1193 م", "عام 1194 م"},
            {"عام (533) ق.م", "عام (534) ق.م", "عام (535) ق.م", "عام (536) ق.م"},
            {"عام 1/1/1956 م", "عام 1/1/1957 م", "عام 1/1/1958 م", "عام 1/1/1959 م"},
            {"بيت لحم", "فيحا", "أريحا", "القدس"},
            {"20-3-2002", "20-3-2003", "20-3-2004", "20-3-2005"},
            {"عام 3هـ", "عام 4هـ", "عام 5هـ", "عام 6هـ"},

            //70
            {"عام 1981 م", "عام 1982 م", "عام 1983 م", "عام 1984 م"},
            {"عام 1961م", "عام 1962م", "عام 1963م", "عام 1964م"},
            {"عام 1962م", "عام 1963م", "عام 1964م", "عام 1965م"},
            {"عام 40 هـ", "عام 41 هـ", "عام 42 هـ", "عام 44 هـ"},
            {"عام 1 هـ", "عام 2 هـ", "عام 3 هـ", "عام 4 هـ"},
            {"عام 5 هـ", "عام 6 هـ", "عام 7 هـ", "عام 8 هـ"},
            {"معركة أجنادين", "معركة نهاوند", "معركة البليخ", "معركة أجنادين"},
            {"قطر", "السعودية", "الكويت", "البحرين"},
            {"في سنه 1920", "في سنه 1921", "في سنه 1924", "في سنه 1925"},
            {"تشونغوا", "بايليغانغ", "كاثي", "دامايدي"},

            //80
            {"تعز", "الحديدة", "عدن", "عبس"},
            {"عام 1930 م", "عام 1931 م", "عام 1932 م", "عام 1933 م"},
            {"جورج الثاني", "هنري ملك فرنسا", "قسطنطين الثاني", "ألكسندر الأول"},
            {"الرومان", "الاغريق", "العرب", "الاتراك"},
            {"البرازيل", "امريكا", "اسبانيا", "انكلترا"},
            {"63 سنه", "64 سنه", "65 سنه", "66 سنه"},
            {"البرازيل", "امريكا", "فرنسا", "انكلترا"},
            {"التوراة", "الزبور", "الإنجيل", "ريك ودا"},
            {"فرنسا سنه 1902", "ايطاليا سنه 1903", "القاهره سنه 1901", "انجلترا سنه 1904"},
            {"دار الحكمه", "دار العلم", "خزانة الكتب", "مكتبة سابور"},

            //90
            {"المانيا", "امريكا", "فرنسا", "انكلترا"},
            {"عز الدين القلق", "عز الدين القسام", "علي حسن سلامة", "عمر حسين شويكة"},
            {"سنه 1096م", "سنه 1097م", "سنه 1098م", "سنه 1099م"},
            {"غزوة الخندق", "غزوه بني القينقاع", "غزوة خيبر", "غزوة تبوك"},
            {"مارماديوك بكثال", "آربري", "روبت كوني", "أندري دي ريور"},
            {"ايطاليا", "اليابان", "المانيا", "أمريكا"},
            {"أهل نجران", "جازان", "بريدة", "تبوك"},
            {"ابن خلدون", "الفارابي", "الرازي", "ابن سينا"},
            {"عام 1890 م", "عام 1891 م", "عام 1892 م", "عام 1893 م"},
            {"الماتريدية", "المعتزلة", "القرامطه", "الجهمية"},

            //100
            {"بوسبوران", "بيليروسيا", "روسيا القيصرية", "مملكة بوسبوران"},
            {"أبو أسيد الساعدي", "أبو أمية الدوسي", "أسيد بن حضير", "أبو برزة الأسلمي"},
            {"عام 20 للهجره", "عام 21 للهجره", "عام 22 للهجره", "عام 23 للهجره"},
            {"لياقت علي خان", "نورالامين", "نواز شريف", "محمد بن جناح"},
            {"وليام هنري", "جورج واشنطن", "جون تايلر", "جيمس بولك"},
            {"ونستون تشرشل", "موسوليني", "نابليون", "أدولف هتلر"},
            {"الإدريسي", "المسعودي", "المرزوقي", "البيروني"},
            {"أصفهان", "طهران", "إسلام آباد", "أردبيل"},
            {"محمد نجيب", "انور السادات", "جمال عبد الناصر", "حسني مبارك"},
            {"البيروني", "الزمخشري", "الإدريسي", "اليعقوبي"}

    };

    public String correctAnswersHistory [] = {

            //10
            "عام 1901م", "الوقائع المصرية", "البصرة", "بنسلفانيا", "40 سنة", "الملفات الساخنة",
            "ماجلان البرتغالي", "عام 1969م", "اللغة الصينية", "عام 1971م",

            //20
            "موسى بن نصير", "الآرامية", "أريحا", "سيواس", "ممتاز محل", "حسين كامل",
            "ممفيس", "501 من المحلفين", "مُراد الأوَّل", "ويليام شكسبير",

            //30
            "ابو ريحان البيروني", "581 م", "حمزة بن عبد المطلب", "حرب الجمل", "تيلوس",
            "ابو يوسف القاضي", "الحروب الصليبيه", "بغداد", "92 سنه", "العدنانيين",


            //40
            "عام 1846", "فرنسا", "هولندا", "بطرسبرج", "جون كينيدي", "القرمزى", "معركة الزاب",
            "23 أكتوبر", "عبد الكريم الخطابي", "عام 1941",

            //50
            "عام 1890", "عام 1933", "اللوفر", "الهكسوس", "عام 1911م", "نـيـرون", "عام 753 ق.م",
            "انجلترا وفرنسا", "فاس", "عام 1934 م",

            //60
            "عام 1857م", "خفرع", "معركة أكتيوم", "عام 1517م", "عام 1193 م", "عام (536) ق.م",
            "عام 1/1/1958 م", "بيت لحم", "20-3-2003", "عام 6هـ",

            //70
            "عام 1982 م", "عام 1961م", "عام 1962م", "عام 41 هـ", "عام 4 هـ", "عام 7 هـ", "معركة نهاوند",
            "البحرين", "في سنه 1924", "كاثي",

            //80
            "تعز", "عام 1930 م", "هنري ملك فرنسا", "الرومان", "انكلترا", "64 سنه", "فرنسا", "ريك ودا",
            "القاهره سنه 1901", "دار الحكمه",

            //90
            "المانيا", "عز الدين القسام", "سنه 1099م", "غزوه بني القينقاع", "روبت كوني", "أمريكا",
            "أهل نجران", "الرازي", "عام 1890 م", "القرامطه",

            //100
            "بيليروسيا", "أسيد بن حضير", "عام 20 للهجره", "محمد بن جناح", "جورج واشنطن",
            "نابليون", "البيروني", "أصفهان", "حسني مبارك", "البيروني"

    };


    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return ListQuestionHistory.length;
    }


    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = ListQuestionHistory[a];
        return question;
    }


    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of milUtip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceHistory[index][num-1];
        return choice;
    }


    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswersHistory[a];
        return answer;
    }
}
