package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 24/04/2018.
 */

public class IslamicQuestions {

    // Array Of Questions
    public String ListQuestionIslamic [] = {

            //10
            " فاتح الصين هو لقب حمله أحد أبطال الفتوحات الاسلاميه. من هو ؟",
            " ما اسم أول مدينه بناها المسلمون فى مصر وبناها عمرو بن العاص ؟",
            " متى حولت القبله من المسجد الاقصى الى المسجد الحرام ؟",
            " ما أقصر سورة في القرآن الكريم ؟",
            " في كم سنة تم نزول القرآن على رسول الله صلى الله عليه وسلم ؟",
            " كم عدد الأنبياء والرسل الذين ذكروا في القرآن الكريم ؟",
            " من الشخص الذي تصارع مع الرسول صلى الله عليه وسلم فسرعه الرسول صلى الله عليه وسلم ؟",
            " من الذي كتب الصحيفة التي نصَّت على مقاطعة بني هاشم وبني عبد المطلب ؟",
            " صحابية كان أبوها و جدها وابنها من الصحابة فمن هي ؟",
            " من هو أول فدائي فى الاسلام ؟",

            //20
            " ما اسم المرأة التي تكلفت بإرضاع النبي صلى الله عليه وسلم ؟",
            " من هو الذي كان تستحي منه ملائكة السماء ؟",
            " ما هي السورة التي كانت سببا في إسلام عمر بن الخطاب رضي الله عنه ؟",
            " ما الإسم الذي أطلق على الذين آمنوا بعيسى عليه السلام ؟",
            " ما أول هدية أهديت إلى الرسول صلى الله عليه وسلم بالمدينة ؟",
            " من أول من نقض العهد مع الرسول صلى الله عليه وسلم من القبائل اليهودية ؟",
            " ما أول جيش خرج من المدينة بعد وفاة الرسول صلى الله عليه وسلم ؟",
            " ما هي السورة التي وردت فيها سجدتان في القرآن الكريم ؟",
            " ما هي الأيكه التي كان يعبدها قوم سيدنا شعيب ؟",
            " من النبي الذي لقب بذي النون ؟",

            //30
            " من النبي الذي سخر له الله الجبال تسبح معه ؟",
            " من هو أول مولود للمهاجرين في المدينة المنورة ؟",
            " ما هي الصلاة التي يركع فيها المصلي أربع مرات ويسجد أربع مرات ؟",
            " ماهي السورة التي يطلق عليها عروس القرآن ؟",
            " من أول ملك فرعوني آمن بالتوحيد ؟",
            " من أول قاضي في البصرة ؟",
            " ما أول صلاة فرضت على الرسول صلى الله عليه وسلم ؟",
            " من أول من ألف في أحكام القرآن ؟",
            " من أول من فتق لسانه بالعربية ؟",
            " من أول من استلم الحجر الأسود من الأئمة ؟",

            //40
            " من أول من قدر الساعات الاثنى عشرة ؟",
            " من أول من قال سبحان ربي الأعلى ؟",
            " من هو الصحابي الذي كانت الملائكة تسلم عليه ؟",
            " ماهو ثاني مسجد صلى النبي صلى الله عليه وسلم فيه الجمعة ؟",
            " ما المسجد الذي استشهد فيه علي بن أبي طالب رضي الله عنه ؟",
            " ماهي السورة التي لا تحوي حرف الميم ؟",
            " في أي الغزوات أسرت الشيماء أخت الرسول صلى الله عليه وسلم من الرضاعة ؟",
            " ما اسم أول عاصمه فى تاريخ الدوله الاسلاميه ؟",
            " من هو الصحابي الذي اهتز عرش الرحمن لموته ؟",
            " ما هى أول عمله فى تاريخ الدوله الاسلاميه ؟",

            //50
            " ما هي السورة التي استمع لها الجن وقالوا سمعناً قرآناً عجبا ؟",
            " من النبي الذي كان يسمى بشرى ؟",
            " من ادخل الخوارزمي في الإسلام ؟",
            " ما اسم القوم الذين لقوا سيدنا إسماعيل ووالدته عند بئر زمزم ؟",
            " من الذي عدلت شهادته شهادة الرجلين ؟",
            " ماذا تسمى الميته التي تقع من مكان مرتفع ؟",
            " ما هما الآيتان اللتان أعطيا النبي صلى الله عليه وسلم وهما من كنوز العرش ؟",
            " من آخر من توفى من الصحابة ؟",
            " من الملقب بذي النورين ؟",
            " ما المقصود بذي الرحم الكاشح ؟",

            //60
            " كم عدة المرأة المتوفى زوجها ؟",
            " كم عدة المرأة المطلقة ؟",
            " متى تم بناء مسجد الرسول صلى الله عليه وسلم ؟",
            " متى شرع الآذان ؟",
            " متى انتهت غزوة الأبوء او غزوة ودان ؟",
            " ما اسم خازن الجنة ؟",
            " متى كانت غزوة بدر الأولى ؟",
            " متى شرع رمضان ؟",
            " ماهي المدينة التي لا يدخلها الطاعون ؟",
            " من هو الرسول الذي راه الرسول (صلي الله عليه وسلم) في السماء الخامسة ؟",

            // 70
            " متي تزوج الرسول (صلي الله عليه وسلم) عائشة بنت ابي بكر الصديق ؟",
            " نبي قال عنه الرسول هو الكريم بن الكريم بن الكريم بن الكريم ؟",
            " ماهو اسم السيف الذي كان لا يفارق النبي (صلي الله عليه وسلم) ؟",
            " متي كانت حجة الوداع ؟",
            " من كان دليل الرسول (صلي الله عليه وسلم) في هجرته ؟",
            "  في اي عام من البعثة النبويه ذهب النبي الي الطائف قاصدا هدايتهم ؟",
            " من استخلفه الرسول(صلي الله عليه وسلم) علي المدينة المنورة في غزوة بدر ؟",
            " بماذا سمي العام الذي قام فيه ابرهة الحبشي بمهاجمة مكة ؟",
            " من هي التي زوجها النجاشي للرسول (صلي الله عليه وسلم) ؟",
            " كم كان عمر النبي عندما ماتت امه ؟",

            //80
            " في اي عا م من البعثة النبوية هاجر النبي الي المدينة ؟",
            " ما اسم الجبل الذي قال عنه الرسول يحبنا ونحبه ؟",
            " متي توفي الرسول (صلي الله عليه وسلم)؟",
            " في ليلة الأسراء ماهي الوسيلة التي كانت تنقل الرسول بين السماوات ؟",
            " متي ولد النبي (صلي الله عليه وسلم)؟",
            " من هما الركعتان اللتان خير من الدنيا وما فيها ؟",
            " في اي دار صلي النبي يوم فتح مكة ؟",
            " ماكان عمر النبي عندما توفي جده ؟",
            " كم كان عمر النبي عندما سافر مع عمه الي الشام للتجارة ؟",
            " ما ذا عرض علي الرسول في رحلة الأسراء والمعراج يشربه؟",

            //90
            " ما هي السنة التي وفدوها الوفود في اقطار شبه الجزيرة العربية؟",
            " ماهي الحرب التي شارك فيها الرسول في شبابه قبل البعثة النبوية؟",
            " ماهي المراة اليهودية التي وضعت السم للرسول” صلي الله عليه وسلم”؟",
            " من هو الذي رمي الرسول يوم احد فجرحت وجنته الشريفه ودعا عليه الرسول فسلط الله عليه تيسا فقتله ؟",
            "  من اي الأشجار يصنع السواك ؟",
            " ما اسم جدة النبي لأمه ؟",
            " كم يوما اقام الرسول بقباء ؟",
            " كم عدد بنات الرسول ؟",
            " ما هو احب انواع العود للرسول (صلي الله عليه وسلم)؟",
            " من التي تزوجها الرسول بعد السيدة خديجة ؟",

            //100
            " كم عدد ركعات صلاة الجنازة ؟",
            " من أول من أرضعت الرسول صلى الله عليه وسلم؟",
            " من أول زوجه توفيت بعد وفاة النبي صلى الله عليه وسلم ؟",
            " من أول من توفيت من بنات الرسول صلى الله عليه وسلم ؟",
            " من هو ترجمان القران وحبر الأمة ؟",
            " من هو أمين هذه الأمة ؟",
            " من أول شهيدة في الإسلام ؟",
            " من أول ممرضة في الإسلام ؟",
            " من أول من رمى سهم في سبيل الله ؟",
            "  من أول من جهر بالقران الكريم ؟"

    };

    // Array Of Multipe Choice For each Question
    private String multipeChoiceIslamic [][] = {

            //10
            {"قتيبه بن مسلم", "أبو عبيدة بن الجراح", "أبو ذر الغفارى", "طلحة بن عبيد الله"},
            {"القاهرة", "اسوان", "الفسطاط", "سينا"},
            {"3 هجريه", "4 هجريه", "2 هجريه", "1 هجريه"},
            {"سورة الناس","سورة الكوثر", "سورة العصر", "سورة الفلق"},
            {" 24 سنة", " 25 سنة", "23 سنة", " 22 سنة"},
            {"25 نبياً ورسولا", "24 نبياً ورسولا", "22 نبياً ورسولا", "23 نبياً ورسولا"},
            {"حارثة بن النعمان", "طلحة الفياض", "سلمان الفارسي", "ركانة"},
            {"منصور بن عكرمة", "سعد بن الربيع", "معاذ بم جبل", "عبد الله بن الزبير" },
            {"أروى بنت الحارث", "أم كلثوم بنت عقبة", "أسماء بنت أبى بكر", "جمانة بنت أبي طالب"},
            {"عبد الله بن مسعود", "على بن أبى طالب", "معاذ بم جبل", "طلحة بن عبيد الله" },

            //20
            {"حليمة السعدية", "خولة بنت عامر", "حسنة أم شرحبيل", "رفيدة الأسلمية"},
            {"أبو أيوب الأنصاري", "كعب بن مالك", "مصعب بن عمير", "عثمان بن عفان"},
            {"سورة طه", "سورة البقرة", "سورة يس", "سورة الرحمن"},
            {"الانصار", "الحواريون", "المسيحيين", "النصارة"},
            {"ماء و عسل", "بلح و لبن", "خبزاً وسمناً", "خبز و تمر"},
            {"بني قينقاع", "بنو النضير", "بنو قريظة", "بنو ثعلبة"},
            {"معاوية بن سفيان", "عمرو بني العاص", "خالد بن الوليد", "سلمة بن الزبير"},
            {"سورة الحج", "سورة القصص", "سورة الانفال", "سورة مريم"},
            {"البقرة", "الشجرة", "الشمس", "القمر"},
            {"يوسف", "موسى", "يونس", "عيسى"},

            //30
            {"سليمان", "نوح", "ابراهيم", "داود"},
            {"عبد الله بن الزبير", "سالم بن معقل", "عبد الله بن رواحة", "زيد بن حارثة"},
            {"الاستسقاء", "الخسوف والكسوف", "العيدين", "الميت"},
            {"سورة النور", "سورة يس", "سورة الاسراء", "سورة الرحمن"},
            {"حبت سخموي", "اخناتون", "سخم خت", "شبسسكاف"},
            {"جعفر المنصور", "الحجاج بن يوسف", "أبو مريم الحنفي", "كعب بن سور"},
            {"صلاة الصبح", "صلاة الظهر", "صلاة العصر", "صلاة المغرب"},
            {"الإمام الشافعي", "الامام احمد", "الامام مالك", "الامام ابو حنيفة"},
            {"ابراهيم", "جبريل", "ابو طالب", "إسماعيل"},
            {"بن سنان", "ابن الزبير", "بن زيد", "بن ربيعة"},

            //40
            {"لوط", "نوح", "يونس", "ايوب"},
            {"عزرافيل", "إسرافيل", "مكائيل", "جبريل"},
            {"عمران بن حصين", "معاذ بن جبل", "أبو الدرداء", "خالد بن الوليد"},
            {"الكعبة", "مسجد جواثا", "مسجد قباء", "مسجد المدينة"},
            {"مسجد قباء", "مسجد المدينة", "مسجد الكوفة", "مسجد الصخرة"},
            {"سورة النصر", "سورة الكوثر", "سورة الفيل", "سورة الفاتحة"},
            {"غزوة حنين", "غزوة بدر", "غزوة احد", "غزوة النضير"},
            {"الرياض", "المدينه المنوره", "مكة", "الطايف"},
            {"سعد بن معاذ", "زيد بن حارثة", "معاذ بن جبل", "أبي بن كعب"},
            {"جنية", "الدرهم", "الريال", "الدينار"},

            //50
            {"سورة الشعراء", "سورة الواقعة", "سورة العلق", "سورة الجن"},
            {"صالح", "ذا الكفل", "هود", "سليمان"},
            {"المنذر بن عمرو", "الحويرث بن عبد الله", "عبد الله بن عمرو", "قتيبة بن مسلم"},
            {"قريش", "تميم", "جهينة", "جرهما"},
            {"خزيمة بن ثابت", "عامر بن فهيرة", "جابر بن عبد الله", "عكاشة بن محصن"},
            {"النطيحة", "الفطيسة", "المترديه", "الزبيحة"},
            {"اواخر سورة النساء", "اواخر سورة يوسف", "أواخر سورة البقرة", "اواخر سورة محمد"},
            {"أنس بن مالك", "بلال بن رباح", "سلمان الفارسي", "حذيفة بن اليمان"},
            {"أبو بكر الصديق", "عمر بن الخطاب", "عثمان بن عفان", "علي بن ابي طالب"},
            {"الذي يضمر المودة", "الذي يضمر الحسد", "الذي يضمر الحب", "الذي يضمر العداوة"},

            //60
            {"٣ أشهر وعشرة أيام", "٤ أشهر وعشرة أيام", "٥ أشهر وعشرة أيام", "٦ أشهر وعشرة أيام"},
            {"3 حيضات", "4 حيضات", "5 حيضات", "6 حيضات"},
            {"السنة الثانية", "السنة الثالثة", "السنة الأولى", "السنة الرابعة"},
            {"١ هجرية", "٢ هجرية", "٣ هجرية", "٤ هجرية"},
            {"١ هجرية", "٢ هجرية", "٣ هجرية", "٤ هجرية"},
            {"مالك", "جبريل", "رضوان", "اسرافيل"},
            {"١ هجرية", "٢ هجرية", "٣ هجرية", "٤ هجرية"},
            {"١ هجرية", "٢ هجرية", "٣ هجرية", "٤ هجرية"},
            {"المدينة المنورة", "مكة", "جدة", "الرياض"},
            {"ابراهيم", "موسي", "هارون", "ادم"},

            //70
            {"10 من البعثة", "11 من البعثة", "12 من البعثة", "11 من البعثة"},
            {"أيوب", "إدريس", "إسماعيل", "يوسف"},
            {"الصمام", "الصارم", "ذو الفقار", "القاطع"},
            {"8 من الهجرة", "9 من الهجرة", "10 من الهجرة", "11 من الهجرة"},
            {"عبدالله بن اريقط", "أبو بكرة الثقفي", "أبو بكر الصديق", "أبو جندل بن سهيل"},
            {"1 قبل الهجرة", "2 قبل الهجرة", "3 قبل الهجرة", "4 قبل الهجرة"},
            {"أبو ذر الغفاري", "ابا سلمة المخزومي", "أبو عبيدة بن الجراح", "أبو هريرة"},
            {"عام النهاية", "عام الحرب", "عام ابرهة", "عام الفيل"},
            {"عائشة", "أم حبيبة", "خديجة", "ام سلمة"},
            {"3 من عمره", "4 من عمره", "5 من عمره", "6 من عمره"},

            //80
            {"8 من البعثة", "9 من البعثة", "10 من البعثة", "11 من البعثة"},
            {"الجبل الأبيض", "جبل الأربع", "جبل أحد", "جبل إدقس"},
            {"12 هجري", "13 هجري", "14 هجري", "15 هجري"},
            {"البراق", "الحصان", "جبريل", "الملائكة"},
            {"عام 573", "عام 574", "عام 575", "عام 576"},
            {"ركعتي الضحى", "ركعتي الفجر", "ركعتي العشاء", "ركعتي المغرب"},
            {"أبو بكر الصديق", "أبو هند الداري", "دار ام هاني", "بلال بن رباح"},
            {"7 اعوام", "8 اعوام", "9 اعوام", "10 اعوام"},
            {"10 عام", "11 عام", "12 عام", "13 عام"},
            {"اللبن والخمر", "اللبن و العسل", "اللبن و التمر", "اللبن و الخبز"},

            //90
            {"6  للهجرة", "7  للهجرة", "8  للهجرة", "9  للهجرة"},
            {"حرب الكفار", "حرب الفجار", "حرب الروم", "حرب الفرس"},
            {"زينب بنت أبي سلمة", "زينب بنت مظعون", "زينب بنت الحارث", "زينب بنت نبيط"},

            {"ابن قماة", "الأقرع بن حابس", "الأصيرم", "الأشعث بن قيس"},
            {"شجرة التوت", "شجرة السيكوا", "شجرة القينوسي", "شجرة الأراك"},
            {"بسرة بنت صفوان", "بره بنت عبد العزي", "خولة بنت ثعلبة", "ميمونة بنت الحارث"},
            {"21  يوما", "22  يوما", "23  يوما", "24  يوما"},
            {"ثلاثة", "اربعة", "خمسة", "ستة"},
            {"البخور", "الصندل", "القماري", "المسك"},
            {"سمية بنت خياط", "سودة بنت زمعة", "مارية القبطية", "حسنة أم شرحبيل"},

            //100
            {"2 ركعات", "4 ركعات", "3 ركعات", "لا ركوع فيها"},
            {"ثويبة جارية أبي لهب", "بسرة بنت صفوان", "حليمة السعدية", "جميلة بنت ثابت"},
            {"خديجة بنت خويلد", "ميمونة بنت الحارث", "زينب بنت جحش", "أم سلمه"},
            {"فاطمة", "رقية", "زينب", "ام كلثوم"},
            {"عبدالله بن عباس", "عبد الله بن عمر", "عبد الله بن مسعود", "عبد الله بن رواحة"},
            {"أبو دجانة الأنصاري", "أبو الدرداء الأنصاري", "أبو عبيدة عامر", "أبو ذر الغفاري"},
            {"سلمى بنت عميس", "سمية بنت خياط", "سهلة بنت سهيل", "سهلة بنت عاصم"},
            {"رفيدة الأسلمية", "رقيقة الثقفيه", "رملة بنت أبي عوف", "ريطة بنت منبه"},
            {"خالد بن الوليد", "جعفر بن أبي طالب", "سعد بن أبي وقاص", "سعد بن معاذ"},
            {"عمر بن الخطاب", "عبدالله بن مسعود", "آبو بكر الصديق", "على بن أبي طالب"}

    };

    // Array Of Correct Answer - In the same order as Array of questions
    public String correctAnswersIslamic [] = {

            //10
            "قتيبه بن مسلم", "الفسطاط", "2 هجريه", "سورة الكوثر", "23 سنة", "25 نبياً ورسولا", "ركانة",
            "منصور بن عكرمة", "أسماء بنت أبى بكر", "على بن أبى طالب",

            //20
            "حليمة السعدية", "عثمان بن عفان", "سورة طه", "الحواريون", "خبزاً وسمناً", "بني قينقاع",
            "سلمة بن الزبير", "سورة الحج", "الشجرة", "يونس",

            //30
            "داود", "عبد الله بن الزبير", "الخسوف والكسوف", "سورة الرحمن", "اخناتون", "أبو مريم الحنفي",
            "صلاة الظهر", "الإمام الشافعي", "إسماعيل", "ابن الزبير",

            //40
            "نوح", "إسرافيل", "عمران بن حصين", "مسجد جواثا", "مسجد الكوفة","سورة الكوثر",
            "غزوة حنين", "المدينه المنوره", "سعد بن معاذ", "الدينار",

            //50
            "سورة العلق", "ذا الكفل", "قتيبة بن مسلم", "جرهما", "خزيمة بن ثابت", "المترديه",
            "أواخر سورة البقرة", "أنس بن مالك", "عثمان بن عفان", "الذي يضمر العداوة",

            //60
            "٤ أشهر وعشرة أيام", "3 حيضات", "السنة الأولى", "١ هجرية", "٢ هجرية", "رضوان", "٢ هجرية",
            "٢ هجرية", "المدينة المنورة", "هارون",

            //70
            "11 من البعثة", "يوسف", "ذو الفقار", "10 من الهجرة", "عبدالله بن اريقط",
            "3 قبل الهجرة", "ابا سلمة المخزومي", "عام الفيل", "أم حبيبة", "6 من عمره",

            //80
            "10 من البعثة", "جبل أحد", "13 هجري", "البراق", "عام 576","ركعتي الفجر",
            "دار ام هاني", "8 اعوام", "12 عام", "اللبن والخمر",

            //90
            "9  للهجرة", "حرب الفجار", "زينب بنت الحارث", "ابن قماة", "شجرة الأراك",
            "بره بنت عبد العزي", "24  يوما", "اربعة", "القماري", "سودة بنت زمعة",

            //100
            "لا ركوع فيها", "ثويبة جارية أبي لهب", "أم سلمه", "رقية", "عبدالله بن عباس",
            "أبو عبيدة عامر", "سمية بنت خياط", "رفيدة الأسلمية", "سعد بن أبي وقاص", "عمر بن الخطاب"

    };

    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return ListQuestionIslamic.length;
    }


    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = ListQuestionIslamic[a];
        return question;
    }


    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of miltip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceIslamic[index][num-1];
        return choice;
    }


    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswersIslamic[a];
        return answer;
    }

}
