package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 01/05/2018.
 */

public class ScienceQuestions {

    public String listQuestionsScience [] = {

            //10
            " كم عدد عضلات جسم الإنسان ؟",
            " كم عدد عـظمة في جسم الإنسان ؟",
            " ما هو علم ' الفيسيولوجيا ؟",
            "ما هو علم ' الستراتيجرافيا '؟",
            "ما هو المرض الذي أُطْـلِـقَ عليه الموت الأسود.  ؟",
            "ما هي أقوى عظام جسم الإنـسان.  ؟",
            "ما هو علم ' الأ نـثروبولوجيا '.  ؟",
            "متى اكتشف البنسلين.  ؟",
            "أين أُجريت أول عملية زراعة قلب بشرى في العالم.  ؟",
            "ما هو المعدن الوحيد الذى يوجد فى الحالة السائلة.  ؟",

            //20
            "ما اكبر عضو في جسم الانسان ؟",
            " ماهو المرض الذي يسمى داء الملوك ؟",
            "ماهو عدد الاسنان في الانسان البالغ ؟",
            " ما هو عدد فقرات الرقبة في الانسان ؟",
            " ماهي اسرع حركة يقوم بها جسم الانسان ؟",
            "أي جزء من اجزاء الدماغ مسؤول عن توازن جسم الانسان ؟",
            "ماهي اكثر اجزاء الجلد شفافية ؟",
            "ماهي المادة التي تشكل 90% من البلازما في دم الانسان ؟",
            " ماذا تسمى الاجسام التي توجد عليها الجينات الوراثية ؟",
            " ماذا تسمى الخلايا الجنسية للمرأة ؟",

            //30
            " من هو مكتشف الدورة الدموية وعمل القلب ؟",
            " ماهي المادة التي تضاف الى ماء الشرب لمنع تسوس الأسنان ؟",
            " من من العلماء يعد اشهر جراحي العرب ؟",
            "متى زرع اول قلب صناعي كامل ؟",
            "من اكتشف الميكروب الذي يسبب مرض السل الرئوي ؟",
            "اول من ابتكر خيوط الجراحة ووصف الجدري والحصبة ؟",
            "عضو كمثري الشكل ملاصق للكبد يتم فيه تخزين العصارة الصفراء للكبد ما اسمه ؟",
            "ما اسم الأنبوب الذي يحمل البول من الكلية الى المثانة ؟",
            "ماهو الاسم العلمي للمياه الزرقاء في العين ؟",
            "ما هو المرض الذي يسببه نقص افراز الإنسولين في جسم الانسان ؟",

            //40
            " ما هي اصلب مادة في جسم الانسان ؟",
            " ماذا يسمى الجزء الخارجي من الاذن الخارجية ؟",
            " كم عدد الحبال الصوتية عند الانسان ؟",
            " ما اسم الخلايا التي في البنكرياس وتقوم بإفراز هرمون الانسولين ؟",
            "ما اسم العظمة التي توجد في نهاية العمود الفقري ؟",
            " ماذا تسمى الأوعية الدموية التي تحمل الدم إلى القلب ؟",
            " كم عضلة يستخدمها الإنسان عندما يتكلم ؟",
            " كم عضلة يستخدمها الإنسان عندما يغضب ؟",
            " كم عدد ضربات قلب الإنسان العادي في الدقيقة ؟",
            " من أين يفرز الأنسولين في جسم الإنسان ؟",

            //50
            " من هو العالم العربي الذي آلف كتاب الشفاء ؟",
            " ما جنسية العالم واط مخترع الآلة البخارية ؟",
            " ما أول عضو تم زرعة بنجاح فى جسم الإنسان ؟",
            " من هو أول من عرف أن سرعة الضوء أكبر من سرعة الصوت ؟",
            " ما هي المادة المسئولة عن تلون جسم الإنسان بالألوان الغامضة ؟",
            " كم عدد السعرات الحرارية في كأس الماء ؟",
            " كم تقدر المسافة التي يقطعها الدم في اليوم أثناء دورانه في الجسم ؟",
            "ماهو العنصر الذي لو وجد في الحليب لأصبح الحليب غذاء كامل ؟",
            " ماهو علم السيتولوجيا ؟",
            " ماهو علم الانثروبيلوجي ؟",

            //60
            " من أبو الطب ؟",
            " أي الحواس الخمس أقل فعالية ؟",
            "ما دور المخيخ في الجسم ؟",
            "ما العضو الذي يستهلك (40 بالمئة ) من أوكسجين الدم ؟",
            " مالون الرئتين السليمتين ؟",
            " ماهو علم الميتورولوجيا ؟",
            " ما هو علم السوسيولوجيا ؟",
            " من العالم العربي الذي اهتم بالنباتات الطبية ؟",
            " في أي شهر تبدأ شعر رأس الجنين وحواجبه بالظهور ؟",
            " كم يبلغ طول المعدة عند الإنسان ؟",

            //70
            " ما هو الفرع الطبي الذي يدرس أنسجة الجسم ؟",
            " من الطبيب الذي كان أول من وصف التهاب الزائدة الدودية ؟",
            " من هو الطبيب الذي أول من سمى مرض السكر بهذا الاسم ؟",
            "من هي أول طبيبة في العالم ؟",
            " من الطبيب العربي الذي أعتمد المداواة بالعلاج بدل الجراحة ؟",
            "كم عدد العضلات التي تتحكم في اتزان العين وأي ارتخاء فيها يسبب الحول ؟",
            " من هو أول من عرف أن سرعة الضوء أكبر من سرعة الصوت ؟",
            " كم يبلغ طول الأمعاء في جسم الإنسان ؟",
            " من أعضاء الجسم وظيفته تكوين الدم وإتلاف القديم من كرياته ؟",
            " ما هو الجزء المسؤول عن ربط العضــلات بالعظام مباشرة",

            //80
            " بروتين يحتوي على الحديد ومهم لنقل الأكسجين في خلايا الدم الحمراء ؟",
            " ما هو الهرمون الذي يضــاد عمل الإنسولين حيث يرفع نسبة السكر في الدم ؟",
            " تعتبر أكثر عضــلات الجسم الإرادية حركة ونشاطا ",
            "من أي الغدد التالية يفرز هرمون الأدرينالين ؟",
            " ما هو العضو الوحيد في جسم الإنسان الذي يعود للنمو بعد قطع جزء منه ؟",
            " متى بدأت عملية زراعة الكبد ؟",
            " ما هو مرض الشيزوفرانيا ؟",
            " ما هو الفيتامين الذي يأخذه الجسم من أشعة الشمس ؟",
            " ما هو الفيتامين الذي يؤدي نقصه لمرض العشى الليلي ؟",
            " أين تقع الغدة الدرقية في الجسم ؟",

            //90
            " ما هو العقار الذي يستخدم مسكن للألم و خافض للحرارة ؟",
            " من مكتشف جرثومة الجرب ؟",
            " ما متوسط وزن الرئتين في الإنسان ؟",
            " كم عدد فقرات عنق الإنسان ؟",
            " ما أقصى درجة يمكن للجسم أن يتحملها ؟",
            " ما هو الاسم الذي يطلق على الخلايا المسئولة عن حماية الخلايا العصبية ؟",
            " كم لترا من الدم يحوي جسم الإنسان ؟",
            " ما هو أصل كلمة الروماتيزم ؟",
            " أين يحدث هضم الكربوهيدرات ؟",
            " ما هو لون العيون الأكثر حساسية للضوء ؟",

            //100
            " ما هي المادة التي تساعد عظامنا على النمو بقوة ؟",
            " ما هي وحدة قياس الصوت ؟",
            " ما هي الألوان التي لا يميزها المصاب بعمى الألوان ؟",
            " ما هي طول شرايين الإنسان ؟",
            " ما الأشعة التي تستطيع اختراق الفولاز ؟",
            " ما هي أثقل مادة في الكرة الأرضية ؟",
            " ما هو أغلى المعادن سعرا في العالم ؟",
            " الفازلين مادة تستخدم في صناعة الادوية والتجميل فمن أين تستخرج هذه المادة ؟",
            " ما هي فصيلة الدم التي تمنح لسائر الفصائل ؟",
            " اقرب حليب طبيعي لحليب المرأة هو حليب ؟"



    };
    public String multipeChoiceScience [][] = {

            //10
            {"620 عضلة", "621 عضلة", "622 عضلة", "623 عضلة"},
            {"204 عـظمة", "205 عـظمة", "206 عـظمة", "207 عـظمة"},
            {"الأشعة الشمسية", "وظائف الأعضاء", "علم الصوت", "علم الهواء"},
            {"علم التشريح", "علم الجمال", "علم العنكبوتيات", "علم طبقات الأرض"},
            {"الايدز", "السرطان", "الطاعون", "الربو"},
            {"عظمة الفخذ", "عظمة الليسان", "عظمة الزراع", "عظمة الارجل"},
            {"علم الآثار", "علم النبات", "علم المناخ", "علم الأجناس"},
            {"عام 1920م", "عام 1921م", "عام 1922م", "عام 1923م"},
            {"جنوب إفريقيا", "امريكا", "فرنسا", "برطانيا"},
            {"الذهب", "الحديد", "الزئبق", "الرصاص"},

            //20
            {"الكبد", "المعدة", "المرارة", "الأمعاء"},
            {"الزهايمر", "النقرس", "اضطراب مزاجي", "الاضطرابات النفسية"},
            {"30 سن", "31 سن", "32 سن", "33 سن"},
            {"5 فقرات", "6 فقرات", "7 فقرات", "8 فقرات"},
            {"النظر", "السمع", "الشم", "العطس"},
            {"المخيخ", "جذع الدماغ", "خلايا الدماغ", "المخ"},
            {"الأذن", "الأنف", "الشفاه", "الخد"},
            {"الحمض النووي", "الدم", "الأكسجين", "الماء"},
            {"كروموبليكسي", "كروموسوم", "متلازمة روبرتس", "كومنز"},
            {"هرمون", "دورة شهرية", "تخصيب", "بويضات"},

            //30
            {"البيروني", "ابن النفيس", "الخوارزمي", "ابن سينا"},
            {"البيريليوم", "الزرنيخ", "البلوتونيوم", "الفلورايد"},
            {"العطار", "الزهراوي", "البغدادي", "الرازي"},
            {"1966 م", "1967 م", "1968 م", "1969 م"},
            {"روبرت إدواردز", "روبرت كوخ", "روبرت هولي", "روبرت هورفيتز"},
            {"ابو بكر الرازي", "أبو الفرج اليبرودي", "ابن الخطيب", "ابن الهيثم"},
            {"البلعوم", "الغدد اللعابية", "المرارة", "البنكرياس"},
            {"المثانة", "الحويصلة", "السدادة", "الحالب"},
            {"التراخوما", "المونسون", "الجلوكوما", "المخروطية"},
            {"السكري", "الأنفلونزا", "حصى الكلى", "التهاب البلعوم"},

            //40
            {"الفلور", "الهيدروجين", "مينا الاسنان", "السيلينيوم"},
            {"المطرقة", "الصـيوان", "القوقعة", "الطبلة"},
            {"4 حبل صوتي", "6 حبل صوتي", "8 حبل صوتي", "10 حبل صوتي"},
            {"خلية ألفا", "خلايا صماوية", "خلية بيتا", "خلية معدية"},
            {"القطنية", "الذيلية", "العجزية", "العصعص"},
            {"شرايين", "أوردة", "أوعية", "خلايا"},
            {"40 عضلة", "41 عضلة", "42 عضلة", "44 عضلة"},
            {"11 عضلة", "12 عضلة", "13 عضلة", "14 عضلة"},
            {"60 ضربة", "70 ضربة", "80 ضربة", "90 ضربة"},
            {"البنكرياس", "الكبد", "القلب", "الدماغ"},

            //50
            {"ابن النفيس", "ابن الهيثم", "ابن سينا", "ابن الخطيب"},
            {"اسكتلندي", "الماني", "فرنسي", "امريكي"},
            {"القلب", "الكلية", "الخلايا", "الشعر"},
            {"الإدريسي", "الطبري", "الرازي", "البيروني", "الخوارزمي"},
            {"الفيوميلانين", "الميلانين", "الكاتيكول", "الإندول"},
            {"4 سعرات", "6 سعرات", "8 سعرات", "صفر"},
            {"250 ألف كيلومتر", "350 ألف كيلومتر", "450 ألف كيلومتر", "550 ألف كيلومتر"},
            {"الكالسيوم", "الزنك", "الحديد", "البوتاسيوم"},
            {"علم الأجنة", "علم الخلايا", "علم الأنساب", "علم الوراثة"},
            {"علم الأنسجة", "علم الثدييات", "علم المعادن", "علم الأمراض"},

            //60
            {"أبو قراط", "أبو الرشيد الرازي", "ابن الخياط", "ابن سينا"},
            {"النظر", "السمع", "الشم", "اللمس"},
            {"الذكريات", "التوازن", "التفكير", "الخيال"},
            {"المخ", "المعدة", "الكبد", "القلب"},
            {"اصفر", "ابيض", "احمر", "وردي"},
            {"علم الميكانيكا", "علم الارصاد الجوية", "علم المناعة", "علم الموسيقى"},
            {"علم الاجتماع", "علم الشيخوخة", "علم الهندسة", "علم الأخلاق"},
            {"ابن الشاطر", "ابن الصفار", "أبن البيطار", "ابن الهيثم"},
            {"الشهر الخامس", "الشهر السادس", "الشهر السابع", "الشهر الثامن"},
            {"23 سم", "24 سم", "25 سم", "26 سم"},

            //70
            {"علم الألم", "علم التشريح", "علم النسج", "علم طب التخدير"},
            {"توماس سودهوف", "توماس مورغان", "توماس أديسون", "توماس ولر"},
            {"الكمايون", "اريتايوس", "ألبير كلود", "أندرو فاير"},
            {"اليزابيث باكويل", "كارول غريدر", "ليندا باك", "ماي بريت موزر"},
            {"ابن الخطيب", "ابن سينا", "أبن زهر الأندلسي", "ابن البيطار"},
            {"6 عضلات", "7 عضلات", "8 عضلات", "9"},
            {"ابن الهيثم", "البيروني", "الإدريسي", "الرازي"},
            {"5 أمتار", "6 أمتار", "7 أمتار", "8 أمتار"},
            {"القولون", "البنكرياس", "الأعور", "الطحال"},
            {"الوتر", "الرباط", "الغضروف", "الرسغ"},

            //80
            {"الهيموسيدرين", "الهيموجلوبين", "الأمينوجلوبين", "الاستروجين"},
            {"الجلوكاجون", "الإستروجين", "التيستوستيرون", "البرولاكتين"},
            {"عضلات الارجل", "عضلات اللسان", "عضلات اليدين", "عضلات العينيين"},
            {"الغدة الدرقية", "الغدة الكظرية", "الغدة النخامية", "الغدة الصنوبرية"},
            {"الدمـاغ", "الجلد", "الكـبد", "الكلية"},
            {"عام 1986 م", "عام 1987 م", "عام 1988 م", "عام 1989 م"},
            {"انفصام الشخصية", "اضطرابات الاكتئابية", "الهلوسة", "الهوس الاكتئابي"},
            {"فيتامين a", "فيتامين b", "فيتامين d", "فيتامين c"},
            {"a فيتامين", "فيتامين b", "فيتامين d", "فيتامين g"},
            {"الرقبة", "الركبة", "المخ", "المعدة"},

            //90
            {"التروكسين", "الداكتون", "الباراستيامول", "أليندوماكس"},
            {"أبن زهر", "ابن الصوري", "ابن باجة", "ابن العطار"},
            {"1100 جم", "1200 جم", "1300 جم", "1400 جم"},
            {"4 فقرات", "5 فقرات", "6 فقرات", "7 فقرات"},
            {"44 درجة", "55 درجة", "66 درجة", "77 درجة"},
            {"الخلية النجمية", "خلايا البطانة", "الخلايا الدبقية", "خلايا شفان"},
            {"4 لتر", "6 لتر", "8 لتر", "10 لتر"},
            {"انجليزي", "عربي", "اغريقي", "لاتيني"},
            {"الفم", "البلعوم", "الوريد", "الكبد"},
            {"اللون الاحمر", "اللون البني", "اللون الأخضر", "اللون الأزرق"},

            //100
            {"الكالسيوم", "النيتروجين", "الهيدروجين", "الأكسجين"},
            {"الدوبسون", "الدارسي", "الديسي", "الديسيبل"},
            {"البنفسجي و الوردي", "الاصفر و البني", "الأحمر والأخضر", "الازرق و الاابيض"},
            {"24 ألف كم", "25 ألف كم", "26 ألف كم", "27 ألف كم"},
            {"أشعة الشمس", "أشعة سينية", "أشعة غاما", "أشعة الليزر"},
            {"الألمينيوم", "اليورانيوم", "السيليكون", "النحاس"},
            {"الراديوم", "الإنديوم", "الروثينيوم", "الكريبتون"},
            {"الشحم", "الجليسرول", "النفط", "النيتروغليسرين"},
            {"O فصيلة", "A فصيلة", "B فصيلة", "AB فصيلة"},
            {"الناقة", "الماعز", "البقرة", "الاتان"}

    };
    public String correctAnswerScience [] = {

            //10
            "620 عضلة", "206 عـظمة", "وظائف الأعضاء", "علم طبقات الأرض", "الطاعون",
            "عظمة الفخذ", "علم الأجناس", "عام 1921م", "جنوب إفريقيا", "الزئبق",

            //20
            "الكبد", "النقرس", "32 سن", "7 فقرات", "العطس", "المخيخ",
            "الشفاه", "الماء", "كروموسوم", "بويضات",

            //30
            "ابن النفيس", "الفلورايد", "الزهراوي", "1969 م", "روبرت كوخ", "ابو بكر الرازي",
            "المرارة", "الحالب", "الجلوكوما", "السكري",

            //40
            "مينا الاسنان", "الصـيوان", "4 حبل صوتي", "خلية بيتا", "العصعص", "أوردة", "44 عضلة", "13 عضلة",
            "80 ضربة", "البنكرياس",

            //50
            "ابن سينا", "اسكتلندي", "الكلية", "البيروني", "الميلانين", "صفر", "250 ألف كيلومتر",
            "الحديد", "علم الخلايا", "علم الأنسجة",

            //60
            "أبو قراط", "الشم", "التوازن", "المخ", "وردي", "علم الارصاد الجوية", "علم الاجتماع",
            "أبن البيطار", "الشهر الخامس", "25 سم",

            //70
            "علم النسج", "توماس أديسون", "اريتايوس", "اليزابيث باكويل", "أبن زهر الأندلسي",
            "6 عضلات", "البيروني", "7 أمتار", "الطحال", "الوتر",

            //80
            "الهيموجلوبين", "الجلوكاجون", "عضلات العينيين", "الغدة الكظرية", "الكـبد", "عام 1989 م",
            "انفصام الشخصية", "فيتامين d", "a فيتامين", "الرقبة",

            //90
            "الباراستيامول", "أبن زهر", "1300 جم", "7 فقرات", "55 درجة", "الخلايا الدبقية",
            "6 لتر", "لاتيني", "الفم", "اللون الأزرق",

            //100
            "الكالسيوم", "الديسيبل", "الأحمر والأخضر", "25 ألف كم", "أشعة الليزر", "اليورانيوم",
            "الراديوم", "النفط", "O فصيلة", "الاتان"



    };



    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return listQuestionsScience.length;
    }


    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = listQuestionsScience[a];
        return question;
    }


    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of milUtip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceScience[index][num-1];
        return choice;
    }


    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswerScience[a];
        return answer;
    }
}
