package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 03/05/2018.
 */

public class SportQuestions {

    public String listQuestionsSport [] ={

            //10
            "أين أقيمت أول بطولة لكأس العالم لكرة القدم؟",
            " ما هو الفريق الذي فاز بأول بطولة بكأس العالم مرتين متتاليتين؟",
            "كم عدد التبديلات المسموح بها للاعبين في الفريق الواحد في كل مباراة؟",
            "كم عدد الإنذارات التي يعطيها الحكم للاعب الواحد قبل أن يُطرد؟",
            "في أي عام حصل أول تعادل سلبي بين فريقين في المباراة النهائية لكأس العالم في كرة القدم؟",
            "ما هو أكثر فريق حاز على كأس العالم حتى عام 2014؟",
            "ما هو أكثر فريق وصل إلى المباراة النهائية لكأس العالم؟",
            "أين أقيمت أول بطولة لكأس القارات؟",
            "كم عدد أشواط كرة السلة؟",
            "كم عدد لاعبين كرة السلة لكل فريق؟",

            //20
            "في أي عام اخترعت لعبة كرة السلة؟",
            "كم عدد لاعبين كرة الطائرة لكل فريق؟",
            "كيف يفوز الفريق في لعبة كرة الطائرة؟",
            "متى اخترعت لعبة كرة الطائرة؟",
            " كم مرة يُسمح لفريق كرة الطائرة بلمس الكرة قبل أن يرميها إلى جهة خصمه؟",
            "كم عدد اللاعبين لكل فريق في كرة اليد للملاعب الخارجية؟",
            "كم عدد التبديلات المسموح بها في كرة اليد؟",
            " متى أصبحت كرة اليد في القاعات الداخلية جزءاً من الألعاب الأولمبية؟",
            "كم مدة كل جولة في لعبة الملاكمة؟",
            " كم عدد جولات لعبة الملاكمة؟",

            //30
            " من هو أول بطل في الملاكمة؟",
            "كم عدد اللاعبين في لعبة البولو؟",
            "متى أقيمت أول بطولة للألعاب الأولمبية لذوي الإحتياجات الخاصة؟",
            "كم عدد الحفر التي في لعبة الغولف؟",
            " متى تأسّس أول نادي منظم للعبة الغولف؟",
            "متى لُعبت لعبة البولو للمرة الأخيرة في الأولمبياد؟",
            "متى دخلت لعبة الجودو إلى الأولمبياد؟",
            "كم يبلغ طول ممر الشخب للعبة البولينغ بالأقدام؟",
            " متى عقدت بطولة كأس الأمم الأفريقية الثالثة والعشرون ؟ً",
            " من هو حارس المرمى الوحيد الذي شارك فى 5 نهائيات لكأس العالم لكرة القدم ؟",

            //40
            "ما هو أول بلد طبق الطريقة الدفاعية فى كرة القدم الكاتناشيو ؟",
            "كم مرة أحرزت الكاميرون بطولة أفريقيا للأمم ؟",
            "اين أقيم أول سباق للسيارات ؟",
            "عدد حكام الساحة فى كرة اليد ؟",
            "من فاز بكأس آسيا عام 2000 فى بيروت ؟",
            "من هو الحارس الذى سجل هدف خطأ فى مرمى فريقه فى منديال 1994 ؟",
            "من هو أول منتخب هزم انكلترا فى ويمبلى فى منديال 1953 ؟",
            "من كان هداف كأس العالم 1954 ؟",
            "من من اللاعبين الذين سجلوا أكثر الاهداف في تاريخ كرة القدم ؟",
            "اين يقع مقر اللجنة الأولمبية الدولية ؟",

            //50

            " متى شاركت نيوزلندا المرة الوحيدة فى نهائيات كأس العالم ؟",
            "كم حكم يكون فى مباراة كرة الطائرة ؟",
            "اي المدن الفرنسية أجريت نصف نهائى بين إيطاليا والبرازيل عام  ؟",
            "كم عدد الأهداف التى سجلها الألمانى ريدله فى منديال 1994 ؟",
            "ما هو المنتخب الوحيد الذى لم يخسر أمام البـرازيل فى منديـال 1958 ؟",
            "كم عدد الأهداف التى سجلت فى مرمى البرازيل فى منديال 1994 ؟",
            "ما هى الدولة الوحيد فى امريكا اللاتينية احتضنت كأس العالم والألومبياد ؟",
            "اين كانت الدورة الأولومبية التى قاطعها العرب ؟",
            "متى كانت أول مشاركة لتونس فى كأس العالم ؟",
            "متى ظهرت البطاقات الصفراء والحمراء فى كرة القدم ؟",

            //60
            "اين  أقيمت أول كأس لكرة القدم البناتية سنة ؟",
            "ما هى أكثر البلدان العربية فوزاً ببطولة أفريقيا لكرة السلة ؟",
            "متى تأسس الاتحاد البرازيلى لكرة القدم ؟",
            "كم رقم اللاعب الايطالى أفيساندور بيير فى منديال  2002 ؟",
            "من هو اللاعب البرازيلى صاحب هدف الفوز فى منديال 1990؟",
            "من هو ألحكم المصري اللذي شارك فى منديال 1934 لكرة القدم ؟",
            "متى تأهلت السعودية لأول مرة للدور الثانى فى كأس العـالم ؟",
            "من اي بلد محمد كالون مهاجم نادى انترميلانو الايطالى ؟",
            "ما هو أكثر منتخبات العالم خسارة للمباريات الفاصلة المؤهلة لكأس العالم ؟",
            "متى كانت أول مشاركة للمغرب في كأس العالم ؟",

            //70
            " ما هى جنسية لاعب كرة السلة كريم عبد الجبار ؟",
            "متى شاركت العراق في كأس العالم ؟",
            "كم مرة فازت البرازيل بكأس العالم حتي منديال 2002 ؟",
            "متى وأين أقيمت أول دورة أولمبية حديثة ؟",
            "كم عدد القوارير في بطولة البولينج ؟",
            "من أول فريق عربي يحصل على بطولة الأمم الآسيوية ؟",
            "أين سرق كأس العالم لكرة القدم لأول مرة ؟",
            "أين موطن لعبة الهوكي ؟",
            "أين يقع الإتحاد العربي للشطرنج ؟",
            "كم عدد درجات الحزام الأسود بالجودو ؟",

            //80

            " ما هي أم الألعاب الرياضية ؟",
            " ما هو أعلى ارتفاع لسلم الغطس ؟",
            " من أول من حصل على الميدالية الذهبية على المستوى الأولمبي من العرب ؟",
            "من أول من عرف كرة القدم الحديثة ؟",
            " من أول من ابتكر رياضة ركوب الدراجـات ؟",
            "من أول شعب عرف الشطرنج ؟",
            " من ابتكر لعبة البلياردو ؟",
            " متى عرفت لعبة الجمبـاز ؟",
            "أين يوجد أكبر ميدان سبـاق للخيـول في العالــم ؟",
            "متى عرفت رياضة سباق السيـارات ؟",

            //90

            "متى بدأت رياضة تسلق الجبـال في العصر الحديث ؟",
            " من أول من وصل إلى قمة ايفرست ؟",
            " أين أكبر حوض للسباحة في العالــم ؟",
            " كم عدد الألعاب الرياضية الممارسة حاليا ؟",
            " من الذي ابتكر رياضة الكاراتيــه ؟",
            " ما عدد أوزان المصارعة ؟",
            " في أي دورة أولمبية فاز محمد علي كلاي بالميدالية الذهبيــه ؟",
            " ما هي مسابقة العدو التي تتم في الطرقات العاديــة ؟",
            " متى وصلت الكويــت إلى نهائيــات كأس العالـــــم ؟",
            " أين اقيمت أول بطولة لكأس العرب ؟",

            //100
            "من أول فريق عربي وصل لنهائيــات كأس العالم ؟",
            "من أول لاعب فاز بأربع ميداليـات في ألعاب القـوى في دورة أولمبيــة ؟",
            " من أول لاعبة حصلت على الدرجة النهائية في تاريخ مسابقات الجمباز ؟",
            " اين بدأت رياضة ركوب الزوارق ؟",
            " متى عرفت رياضة الجمباز ؟",
            " متى عرفت رياضة السباحة ؟",
            " ما أقدم رياضة معروفة للإنسان ؟",
            " ما أشهر رياضة في أسبانيا ؟",
            " ما اللعبة التي تعني فن المرونة واستخدام قوة الخصم ضده ؟",
            " ما أكثر دولة حصلت على كأس آسي ؟",


    };
    public String multipeChoiceSport [][] = {

            //10
            {"الأوروغواي", "الولايات المتحدة", "المكسيك", "الاكوادور"},
            {"البرازيل", "إسبانيا", "الارجنتين", "إيطاليا"},
            {"2 تبديلات", "3 تبديلات", "4 تبديلات", "5 تبديلات"},
            {"إنذاران", "3 إنذار", "4 إنذار", "5 إنذار"},
            {"عام 2006", "عام 2002", "عام 1998", "عام 1994"},
            {"اورغواي", "المملكة المتحدة", "البرازيل", "إسبانيا"},
            {"كوبا", "فرنسا", "ألمانيا", "أميركا"},
            {"السعودية", "الصين", "قطر", "البرتغال"},
            {"شوطان", "3 شوط", "4 شوط", "5 شوط" },
            {"4 لاعبين", "5 لاعبين", "6 لاعبين", "7 لاعبين"},

            //20
            {"عام 1890", "عام 1891", "عام 1892", "عام 1893" },
            {"لاعبان", "4 لاعبين", "6 لاعبين", "8 لاعبين"},
            {"يحرز 10 نقطة", "يحرز 12 نقطة", "يحرز 20 نقطة", "يحرز 25 نقطة"},
            {"عام 1890", "عام 1895", "عام 1897", "عام 1899"},
            {"3 مرات", "4 مرات", "5 مرات", "6 مرات"},
            {"10 لاعب", "11 لاعب", "12 لاعب", "13 لاعب"},
            {"3 تبديلات", "4 تبديلات", "5 تبديلات", "غير محدود"},
            {"عام 1972", "عام 1974", "عام 1976", "عام 1978"},
            {"دقيقتان", "3 دقائق", "4 دقائق", "4 دقائق"},
            {"6 جولة", "8 جولة", "10 جولة", "12 جولة"},

            //30
            {"محمد علي", "جيمس فيغ", "مايك تايسون", "جورج فورمان"},
            {"4 لاعبين", "6 لاعبين", "8 لاعبين", "10 لاعبين"},
            {"عام 1962", "عام 1964", "عام 1966", "عام 1968"},
            {"14 حفرة", "16 حفرة", "18 حفرة", "20 حفرة"},
            {"عام 1644", "عام 1744", "عام 1844", "عام 1944"},
            {"عام 1932", "عام 1934", "عام 1936", "عام 1938"},
            {"عام 1962", "عام 1964", "عام 1966", "عام 1968"},
            {"40 قدماً", "50 قدماً", "60 قدماً", "70 قدماً"},
            {"مالي", "السنغال", "جنوب افريقيا", "نيجيريا"},
            {"آيتور إمبيلا", "أليكس برونر", "أليسون بيكر", "أنطونيو كاربخال"},

            //40
            {"البرتغال", "سويسرا", "إسبانيا", "ايطاليا"},
            {"3 مرات", "4 مرات", "5 مرات", "6 مرات"},
            {"فرنسا", "المانيا", "السلفادور", "الاكوادور"},
            {"اثنان", "3 حكام", "4 حكام", "5 حكام"},
            {"كوريا الجنوبية", "اليابان", "الكويت", "السعودية"},
            {"روني يارستين", "كاميلو فارغاس", "مارفين هيتز", "اسكوبار"},
            {"المجر", "البرتغال", "هولندا", "المكسيك"},
            {"هوغو سانشيز", "هانس كرانكل", "كوشكيش", "غيرد مولر"},
            {"بيليه", "كريستيانو رونالدو", "ليونيل ميسي", "جوزيف بيكان"},
            {"برلين", "لوزان", "روما", "مدريد"},

            //50
            {"سنة 1982", "سنة 1986", "سنة 1990", "سنة 1994"},
            {"حكم واحد", "حكمين", "3 حكم", "4 حكم"},
            {"باريس", "ليون", "ليل", "مارسيليا"},
            {"1 هدف", "2 هدف", "3 هدف", "4 هدف"},
            {"إسبانيا", "سويسرا", "المانيا", "انجلترا"},
            {"3 أهداف", "4 أهداف", "5 أهداف", "6 أهداف"},
            {"جاميكا", "المكسيك", "اورغواي", "الارجنتين"},
            {"بروكسيل", "برلين", "باريس", "موسكو"},
            {"سنة 1974", "سنة 1978", "سنة 1982", "سنة 1986"},
            {"عام 1970", "عام 1974", "عام 1978", "عام 1982"},

            //60
            {"فنلندا", "اليونان", "الصين", "اليابان"},
            {"مصر", "المغرب", "تـونس", "الكاميرون"},
            {"سنة 1912", "سنة 1914", "سنة 1916", "سنة 1918"},
            {"7 الرقم", "9 الرقم", "10 الرقم", "11 الرقم"},
            {"دودوه", "دينو باجو", "موللو", "دييغو ميليتو"},
            {"يوسف محمد", "مصطفى كامل", "فاروق بوظو", "يوسف الغول"},
            {"سنة 1990", "سنة 1994", "سنة 1998", "سنة 2002"},
            {"غانا", "كينيا", "سيراليون", "ليبيريا"},
            {"النرويج", "استراليا", "البرتغال", "السويد"},
            {"سنة 1970", "سنة 1974", "سنة 1978", "سنة 1982"},

            //70
            {"مصري", "جزائري", "مغربي", "أمريكي"},
            {"سنة 1986", "سنة 1990", "سنة 1994", "سنة 1998"},
            {"4 مرات", "5 مرات", "6 مرات", "7 مرات"},
            {"برلين 1896 م", "لندن 1896 م", "أثينا 1896 م", "باريس 1896 م"},
            {"6 قوارير", "8 قوارير", "10 قوارير", "12 قوارير"},
            {"الكويت", "السعودية", "لبنان", "قطر"},
            {"إسبانيا", "هولندا", "انجلترا", "ايطاليا"},
            {"الهند", "اليابان", "استراليا", "افغانستان"},
            {"الجزائر", "البحرين", "تونس", "مصر"},
            {"6  درجة", "8  درجة", "10  درجة", "12  درجة"},

            //80
            {"ألعاب القوى", "كرة القدم", "كرة الطاولة", "كرة السلة"},
            {"8 متر", "10 متر", "12 متر", "14 متر"},
            {"هشام الكروج", "ابراهيم شمس", "رشيد رمزي", "السيد نصير"},
            {"الإنجليز", "الاسبانيين", "الامريكيين", "البرازيليين"},
            {"الالمانيون", "اليونانيون", "الفرنسيون", "الايطاليون"},
            {"الاغريق", "الفــــرس", "الاتراك", "الصينيون"},
            {"الفرنسيون", "الاسبانيون", "إلإسكتلنديون", "الامريكيون"},
            {"عام 1774م", "عام 1775م", "عام 1776م", "عام 1777م"},
            {"بريطانيا", "كرواتيا", "المانيا", "ايطاليا"},
            {"عام 1876م", "عام 1877م", "عام 1878م", "عام 1879م"},

            //90
            {"عام 1850م", "عام 1852م", "عام 1853م", "عام 1854م"},
            {"أراثيلي سيجارا", "إدموند هيلاري", "راي جينيه", "رينولد ميسنر"},
            {"المغـرب", "اليابان", "المكسيك", "هولندا"},
            {"64 رياضة", "66 رياضة", "68 رياضة", "70 رياضة"},
            {"الصينيون", "اليابانيون", "الأمريكان", "الإنجليز"},
            {"8 أوزان", "10 أوزان", "12 أوزان", "14 أوزان"},
            {"دورة لندن", "دورة روما", "دورة باريس", "دورة مدريد"},
            {"سباق تتابع", "ألعاب القوى", "الماراثون", "السومو"},
            {"عام 1982م", "عام 1986م", "عام 1990م", "عام 1994م"},
            {"الرِباط", "عًـمان", "بيروت", "بغداد"},

            //100
            {"الكويت", "مصر", "المغرب", "تونس"},
            {"جيس أونز", "مايكل فيلبس", "بوريس شاخلين", "بآفو نورمي"},
            {"لاريسا لاتينينا", "تاكاشي اونو", "سيمونا أمانار", "ناديه كومانشي"},
            {"بريطانيا", "فرنسا", "الهند", "اليابان"},
            {"جاميكا", "ايسلندا", "ألمانيا", "فنلندا"},
            {"عام 33 ق.م", "عام 34 ق.م", "عام 35 ق.م", "عام 36 ق.م"},
            {"شد الحبل", "المصارعة", "ركوب الخيل", "السباحة"},
            {"كرة القدم", "مصارعة الثيران", "الرماية", "السباق"},
            {"الجودو", "المبارزة", "المصارعة", "السباحة"},
            {"الصين", "استراليا", "اليابان", "السعودية"}

    };
    public String correctAnswersSport [] = {

            //10
            "الأوروغواي", "إيطاليا", "3 تبديلات", "إنذاران", "عام 1994", "البرازيل",
            "ألمانيا", "السعودية", "شوطان", "5 لاعبين",


            //20
            "عام 1891", "6 لاعبين", "يحرز 25 نقطة", "عام 1895", "3 مرات", "11 لاعب",
            "غير محدود", "عام 1972", "3 دقائق", "12 جولة",

            //30
            "جيمس فيغ", "4 لاعبين", "عام 1968", "18 حفرة", "عام 1744", "عام 1936",
            "عام 1964", "70 قدماً", "مالي", "أنطونيو كاربخال",

            //40
            "ايطاليا", "4 مرات", "فرنسا", "اثنان", "اليابان", "اسكوبار", "المجر",
            "كوشكيش", "جوزيف بيكان", "لوزان",

            //50
            "سنة 1982", "حكم واحد", "مارسيليا", "1 هدف", "انجلترا", "3 أهداف",
            "المكسيك", "موسكو", "سنة 1978", "عام 1970",

            //60
            "الصين", "مصر", "سنة 1914", "7 الرقم", "موللو", "يوسف محمد", "سنة 1994",
            "سيراليون", "استراليا", "سنة 1970",

            //70
            "أمريكي", "سنة 1986", "5 مرات", "أثينا 1896 م", "10 قوارير", "الكويت",
            "انجلترا", "الهند", "تونس", "12  درجة",

            //80
            "ألعاب القوى", "10 متر", "السيد نصير", "الإنجليز", "الفرنسيون", "الفــــرس",
            "الفرنسيون", "عام 1776م", "بريطانيا", "عام 1878م",

            //90
            "عام 1854م", "إدموند هيلاري", "المغـرب", "66 رياضة", "الصينيون", "10 أوزان",
            "دورة مدريد", "الماراثون", "عام 1982م", "بيروت",

            //100
            "مصر", "جيس أونز", "ناديه كومانشي", "بريطانيا", "ألمانيا", "عام 36 ق.م",
            "شد الحبل", "مصارعة الثيران", "الجودو", "السعودية"

    };

    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return listQuestionsSport.length;
    }


    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = listQuestionsSport[a];
        return question;
    }


    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of miltip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceSport[index][num-1];
        return choice;
    }


    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswersSport[a];
        return answer;
    }

}
