package com.drmas.issam.quizeaslamic;

/**
 * Created by drmas on 04/05/2018.
 */

public class TechnologyQuestions {


    public String listQuestionsTechnology [] = {

            //10
            " من برامج  (معالجة النصوص) مما يلي ؟",
            " يتم إدخال البيانات الصوتية إلى الحاسوب بواسطة ؟",
            " من أجزاء الحاسوب الرئيسة، تستخدم لحفظ البيانات المدخلة إلى الحاسوب، هي ؟",
            " تعتبر أدأة تستخدم لإدخال الصوت إلى الحاسوب هي ؟",
            " من أدوات الإخراج في الحاسوب، تستخدم لإخراج المعلومات الصوتية هي ؟",
            " يمكن تخزين المعلومات في الحاسوب على ؟",
            " يستخدم مفتاح الإدخال ENTER في برنامج  (مايكروسوفت وورد) لـ .. ؟",
            " وحدة قياس سعة الذاكرة هي .. ؟",
            "  في الحاسوب، من أدوات الإخراج، يتم عرض النتائج عليها مباشرة هي .. ؟",
            " ما وحدة قياس الصوت ؟",

            //20
            " ما هو الشى اللذي  يتصل بجهازين أو أكثر معاً من أجل تبادل المعلومات ؟",
            " ما هو اللذي يتم بهيكلية لوصل أنظمة الكمبيوتر على الشبكة ؟",
            " ما هو البرنامج اللذي  يستعمل لاستكشاف موارد الإنترنت ؟",
            " ما هو شئ يتيح لك تنفيذ عمليات بحث بواسطة كلمات أساسية لإيجاد صفحات ويب تهمك ؟",
            "  البايت هي وحدة قياس ؟",
            "ما هي المادة المسئولة عن تلون جسم الإنسان بالألوان الغامضة ؟",
            " ذاكرة لها نفس حجم وشكل بطاقة الائتمان, تحتوي على دائرة حاسوب فيها ذاكرة ومعالج وموقع تخزين دائم, يمكن استرجاع البيانات المخزنة فيها ؟",
            " تقاس سرعة الحاسوب بـ ؟",
            " مجموعة من التعليمات المتسلسلة والمرتبة بشكل منطقي تقوم بتوجيه الكمبيوتر لأداء وظيفة ما،مكتوب بلغة برمجية معينه, وتسمى ؟",
            " هو الشخص الذي يقوم بكتابة البرامج مستخدما لغة برمجة واحده أو أكثر, ويسمى بـ ؟",

            //30
            "البرمجيات التي يستخدمها الحاسوب ليقوم بعمله على أكمل وجه, ونسميها ؟",
            "برمجيات النظم(System Software) من أمثلتها ؟",
            " تعد اللغة الأساسية لجهاز الحاسوب, وتتكون برامجها المكتوبة من أرقام ثنائية (1,0) نسميها بـ ؟",
            "احد مراحل دورة حياة النظام التي يتم من خلالها إعداد التصاميم المنطقية Logical Design للنظام, وهذه المرحلة تسمى بـ ؟",
            " كانت زرقاء اليمامة تبصر من مسيرة تقارب ؟",
            " مجموعة من الحواسيب مرتبطة مع بعضها البعض عن طريق خطوط اتصال بحيث تغطي منطقة محدودة مثل مكتب أو مبنى أو مجموعة مباني. نسمي هذه الشبكة بـ ؟",
            "وحدة قياس المسافات البحريّة هي  ؟",
            " احد أنواع الخوادم (Servers) يخزن عليه موقع الويب الخاص بالمنشأة ,ويسمى بـ ؟",
            "عبارة عن وحدة ربط تستخدم في إرسال واستقبال البيانات عبر خطوط الهاتف, تعريف لـ ؟",
            "أم المؤمنين التي أرسل إليها الله عزوجل السلام مع جبريل هي...؟",

            //40
            "أول اتصال بين حاسوبين تم في أمريكا (Arpanet) في بداية ؟",
            "احد خدمات الانترنت وتمكنك من إرسال واستقبال الرسائل عبر الانترنت ، بسرعة هائلة وكلفة قليلة ؟",
            "ما هي الطاقة التي يولدها البرق ؟",
            "يقاس سرعة الرياح بجهاز ؟",
            "وقود المحركات النفاثة للطائرات هو ؟",
            "يسمى علمياً البنزين الذي يستخدم للسيارات بإسم ؟",
            " من أي مادة تصنع منها إطارات السيارات ؟",
            "الغاز الذي يشكل حوالي 75 %من اجمالي كتلة الشمس هو. ؟",
            "الماء الذي يتجمد على نحو أسرع عند وضعه في داخل الفريزرهو..؟",
            "ما هي جنسية العالم الفيزيائي جورج أوهم الذي أكتشف القوانين الأساسية للتيار الكهربائي ؟",

            //50
            "من هو مخترع الهاتف ؟",
            "من هو مخترع الدراجة ؟",
            "من هو مخترع المذياع ؟",
            "من هو مخترع التلفاز ؟",
            "من هو مخترع الحاسوب ؟",
            "من هو مخترع الآلة الحاسبة ؟",
            "من هو مخترع الدبابة ؟",
            "من هو مخترع المسدس ؟",
            "من هو مخترع السيارة ؟",
            "من هو مخترع المولد الكهربائي ؟",

            //60
            "من هو مخترع من هو مخترع الورق ؟",
            "من هو مخترع من هو مخترع الديناميت ؟",
            "من هو مكتشف البنسلين ؟",
            "من هو مكتشف قانون الجاذبيه الارضيه ؟",
            "من هو مخترع الكاميرا ؟",
            "من هو مخترع الاسمنت ؟",
            "من هو مخترع المصبـاح الكهربائي ؟",
            "من هو مخترع القطــــــار ؟",
            "ما هو الهرمون الذي يفتقر إليه مرضى السكر ؟",
            "الكوكب الذي طول اليوم فيه 6,39 يوماً أرضياً هو كوكب ؟",

            //70
            "ما أكبر العناصر التي تتألف منها القشرة الأرضية والذي يؤلف 25% من القشرة الأرضية ؟",
            "المعدن الوحيد الذي يكون سائلا في درجات الحرارة العادية؟",
            " ما هو المعدن الذي يحوي على موصلة حرارية؟",
            " ما هو الإسم العلمي الذي يطلق على أبعد نقطة في مدار القمر عن الأرض ؟",
            "تحرك الغاز تحت تأثير الضغط من خلال ثقب صغير يسمي في المجال العلمي بإسم الإنسكاب الغازي أو....؟",
            "زيت الوقود الذي يستخدم في حرقه لتوليد بخار الماء المستخدم في إدارة محركات وتوربينات بخارية في محطات توليد الكهرباء يسمى...؟",
            "هدروكربون غازى لا لون له، يحتوى جزيؤه على رابطة ثلاثية، ويتميز بفعاليات كيميائية عالية فما هو..؟",
            "حمض عضوى يوجد فى نبات العفص، وهو حمض ثلاثى هدروكسى بنـزويك يسمى حمض ..؟",
            " مجموعة المواد الحمضية التى تنتج من تحلل النباتات والأعشاب وغيرها، توجد فى الطبقة السطحية من التربة وتسمى بـ ..؟",
            " سكرثمر البلوط هو نوع من السكريات يستخلص من ثمر البلوط ويسمى أيضاَ ..؟",

            //80
            "من هو مخترع المسدس ؟",
            "أول رائد فضاء أمريكي هو ..؟",
            " أول حقل نفطي تم اكتشافه في دولة الكويت بواسطة شركة نفط الكويت هو حقل..؟",
            "ماهي جنسية العالم  لويس إديسون وتر مان مخترع القلم الحبر ؟",
            "من هو مخترع السوسته؟",
            "ماهي جنسية العالم و.هـ. كارير هو مخترع  التكييف ؟",
            "ماهي جنسية العالم جون هولاند مخترع الغواصه ؟",
            "العالم الكسندر رولان هومخترع ..؟",
            " في أي دولة تم أفتتاح أول مترو أنفاق في العالم ؟",
            " ما هي جنسية العالم الفيزيائي جورج أوهم الذي أكتشف القوانين الأساسية للتيار الكهربائي ؟",

            //90
            " ماذا يقاس بمقياس رختر أو السسموجراف ؟",
            " من أول من أخترع بارود البنادق ؟",
            "ماذا يطلق على عملية تحويل المادة الصلبة إلى سائلة ؟",
            " ماهي وحدة قياس جرعة الإشعاع ؟",
            " شركه عريقه تستخدم في عمليات البحث على الانترنت ؟",
            "من مكتشف الفيسبوك ؟",
            "من هو مؤسس شركة مايكروسوفت ؟",
            "من هو من هو مؤسس جوجل ؟",
            "من هو مخترع الانترنيت ؟",
            "من متصفحات الانترنت ما هو ؟",

            //100
            "قطعه فى الكمبيوتر مسؤوله عن سرعه الكمبيوتر ؟",
            "ما هو نظام التشغيل للهواتف السامسونج ؟",
            " ما هو اشهر موقع تسوق علي الانترنت ؟",
            "في اي سنه تاسس جوجل ؟",
            "طاقة تطلق في شكل موجات أو جسيمات صغيرة ، توجد في كل أنحاء الكون ، ولها أشكال متعدّدة ؟",
            "فيزيائي إنجليزي اكتشف مبادئ الكهرومغناطيسية وابتدع الدينمو . من هو ؟",
            "ما المصدر الطبيعي الرئيسي للأشعّة فوق البنفسجية ؟",
            "جسيمات ذات شحنة موجبة ، أوّل من لاحظها الفيزيائي الألماني فيلهلم عام 1902م :",
            "مانوع الموجات التي يرسلها الرادار ؟",
            "ما وحدة قياس شدّة التيّار الكهربائي ؟"


    };
    public String multipeChoiceTechnology [][] = {

            //10
            {"ويندوز", "مايكروسوفت وورد", "أكسيل", "أكسيس"},
            {"الميكروفون", "السماعة", "لوحة المفاتيح", "الفأرة"},
            {"لوحة المفاتيح", "السماعة", "الفأرة", "الذاكرة"},
            {"الطابعة", "الشاشة", "السماعة", "الميكروفون"},
            {"الشاشة", "السماعات", "الطابعة", "الميكروفون"},
            {"الشاشة", "الطابعة", "القرص", "الورق"},
            {"حذف حرف قبل", "حذف حرف يلي", "إضافة فراغ بعد", "فتح سطر جديد"},
            {"المتر", "ميجا بايت", "السنتميتر", "الكيلو متر"},
            {"الماسح الضوئي", "لوحة المفاتيح", "الشاشة", "الفأرة"},
            {"ديسبل", "فمتومتر", "هكتومتر", "إكسامتر"},

            //20
            {"الشبكة", "مزود طاقة", "توافق تشغيلي", "التوافق"},
            {"الهاكر", "الكراك", "الباتش", "الخادم"},
            {"الموقع الإلكتروني", "متصفح ويب", "تجسس إلكتروني", "منفذ حاسوب"},
            {"كلمة مرور", "مزود خدمة", "محرك بحث", "حساب المستخدم"},
            {"الطاقة", "الذاكرة", "الصوت", "التيار"},
            {"الميلانين", "الفيوميلانين" , "الأشعة", "الميكروب"},
            {"الشريط الممغنط", "أقراص", "البطاقة الذكية", "إجراء مخزن"},
            {"الجيجا هيرتز", "الجيجا بايت", "الجيجابت", "اليوتابايت"},
            {"المبرمج", "البرمجيات", "البرنامج", "برمجة قصوى"},
            {"المخترق", "المستخدم", "الهاكر", "المبرمج"},

            //30
            {"برمجيات النظم", "البرمجيات التطبيقية", "برمجيات وسيطة", "جميع ما ذكر"},
            {"لغات البرمجة", "نظم التشغيل", "مرحلة تطوير", "جميع ما ذكر"},
            {"لغة الآلة", "لغة التجميع", "لغة الجافا", "لغات عالية المستوى"},
            {"مرحلة التحليل", "دراسة الجدوى", "مرحلة التصميم", "مرحلة التطبيق"},
            {"3 أيام", "4 أيام", "5 أيام", "6 أيام"},
            {"الشبكة الموسعة", "الشبكة المحلية", "شبكة النجمة", "الشبكة العنكبوتية"},
            {"العقدة", "الميل", "الياردة", "الكيلو"},
            {"خادم الويب", "خادم الملفات", "خادم الطباعة", "خادم الاتصالات"},
            {"الشبكة", "المودم", "الخادم", "الإكسابايت"},
            {"خديجة", "حفصة", "سؤدة", "عائشة"},

            //40
            {"السبعينات", "الثمانينات", "التسعينات", "الالفينات"},
            {"محركات البحث", "المودم", "البريد الالكتروني", "شبكة الناقل"},
            {"مغناطيسية", "كهربائية", "كهرومغناطيسية", "حرارية"},
            {"بوفورت", "الايثرومتر", "الترمومتر", "الانيمومتر"},
            {"الجازولين", "البوتجاز", "الكيروسين", "المازوت"},
            {"الكيروسين", "الكازلين", "الجازولين", "البوتجاز"},
            {"من المطاط", "من الجلد", "من الفلين", "من البلاستيك"},
            {"النتروجين", "الأوكسجين", "الهيدروجين", "الكالسيوم"},
            {"الماء البارد", "الماء المعتدل", "في وقت واحد", "الماء الساخن"},
            {"أمريكي", "هولندي", "صيني", "ألماني"},

            //50
            {"أنطونيو ميوتشي", "أدولف ساكس", "اينيس كوفي", "آلان بلومن"},
            {"البرتو سانتوس", "الكسندر ماكولين", "ألفريد نوبل", "كيرك باتريك"},
            {"آرثر وين", "جوجليمو ماركوني", "بارنز واليس", "برنار تيلجين"},
            {"بوريس روزنغ", "بريان دنكن", "جون لوجي بيرد", "إيوان سيرورير"},
            {"تشارلز باباج", "دوغلاس إنجلبرت", "جون فنسنت", "هوارد آيكن"},
            {"بليز باسكال", "يوهان غوتنبرغ", "نيكولاي بروسنتسوف", "فيلو فارنسورث"},
            {"روبرت غودارد", "إرنست سونيتون", "فلاديمير بارمين", "وليام جورج"},
            {"فاسيلي ديكترويف", "فيكتور فاسنيتسوف", "صموئيل كولت", "تيبو سلطان"},
            {"لودفيج نوبل", "نيكولا جوزيف", "بيوتر شيلوفيسكي", "كارل بنز"},
            {"مايكل فاراداي", "لويد جروف", "جوزيف سوان", "همفري ديفي"},

            //60
            {"آرثر وين", "بي شنغ", "كاي لون", "اوقنجسلاف" },
            {"الفريد نوبل", "أندريه شوخوف", "ادوارد تيلر", "انريكو فيرمي"},
            {"أنتوني بارنجر", "عمار الموصلي", "فريتز كلات", "فلمنج"},
            {"تشارلز داروين", "اسحاق نيوتن", "جاليليو جاليلي", "نيكولا تيسلا"},
            {"ايدوارد مايبردج", "ماسكاتوف", "جورج ايستمان", "تشارلز فرانسيس"},
            {"كارل ريكارد", "بنيامين تشيو", "جورج ستيفنسون", "جوزيف اسبن"},
            {"أديسون", "أينشتاين", "جورج كلود", "هاينريش جوبل"},
            {"إيفان المانوف", "جورج إستيفنس", "روتيسلاف", "فريتز كلات"},
            {"الانثولين", "البوتاسيوم", "الانثولين", "الأنسولين"},
            {"عطارد", "زحل", "بلوتو", "المريخ"},

            //70
            {"الحديد", "السليكون", "الماغنسيوم", "الكلور"},
            {"اليرانيوم", "النشادر", "الماغنسيوم", "الزئبق"},
            {"الماس", "الذهب", "الفضة", "المرجان"},
            {"الفوج", "الروج", "الموج", "الأوج"},
            {"الانحباس", "الإنبجاس", "الانصهار", "الالتباس"},
            {"الكيروسين", "البوتجاز", "المازوت", "الجازولين"},
            {"أسيتيلين", "هيدروستات", "أسيت هدرات", "كربوأستيل"},
            {"الخليك", "الجاليك", "السكسنيك", "الماثونيك"},
            {"حمض الدبيلين", "حمض النتريك", "حمض الموفاليك", "حمض الدُّبَال"},
            {"مايثيول", "استيوليل", "كريسيتول", "سكرستول"},

            //80
            {"جورج أديسون", "مارشال أفيان", "صمويل كولت", "كميل هارف"},
            {"الآن شيبرد", "جورج إيفان", "جورج جاتشسوف", "انشتاين ماركلي"},
            {"نيسان", "بيحان", "ريحان", "برقان"},
            {"روسي", "الماني", "امريكي", "فرنسي"},
            {"أورفيل رايت", "لبور رايت", "الكسندر رولايت", "هويتكوم جادسون"},
            {"امريكي", "روسي", "استرالي", "ايطالي"},
            {"انجليزي", "امريكي", "الماني", "روسي"},
            {"طفاية الحريق", "علبة الكبريت", "الراديو", "البوصله"},
            {"فرنسا", "أنجلترا", "روسيا", "الصين"},
            {"أمريكي", "هولندي", "صيني", "ألماني"},

            //90
            {"سرعة الرياح", "الضغط الجوي", "الزلازل", "سرعة السفن"},
            {"العرب", "الروم", "الصينيون", "الفرس"},
            {"التبخّر", "الغليان", "الانصهار", "التسامي"},
            {"جول", "راد", "إكس", "وات"},
            {"جوجل", "امازون", "فيسبوك", "تويتر"},
            {"مارك زوكربيرغ", "شون باركر", "تشارلي شيفر", "ديف مورين"},
            {"بول ألين", "ساتيا ناديلا", "جون تومسون", "بيل غيتس"},
            {"إيريك شميت", "لاري بايج", "ساندر بيتشاي", "سيرجي برين"},
            {"تشارلز بابيج", "توماس فولر", "تيم بيرنرز لي", "غوردون مور"},
            {"لينكس", "مايكروسوفت", "فاير فوكس", "سكايب"},

            //100
            {"الذاكرة الرئيسية", "مولد الطاقة", "القرص الصلب", "الرام"},
            {"ويندوز فون", "أندرويد", "ي أو إس", "بلاكبيري"},
            {"ويكيبيديا", "على بابا", "أمازون", "ياهو"},
            {"عام 1992", "عام 1994", "عام 1996", "عام 1998"},
            {"الذبذبة", "الإشعاع", "الصوت", "الشحنة الكهربائيّة"},
            {"جليليو", "توماس أديسون", "جيمس وات", "مايكل فارادي"},
            {"طبقة الأوزون", "الشمس", "الاحتراق", "الأرض"},
            {"الإلكترون", "النيترون", "البروتون", "الأيون"},
            {"كهرومغناطيسية", "مغناطيسية", "كهربائيّة", "متردّدة"},
            {"الأوم", "الواط", "الأمبير", "الفولت"}
    };
    public String correctAnswerTechnology [] ={

            //10
            "مايكروسوفت وورد", "الميكروفون", "الذاكرة", "الميكروفون", "السماعات",
            "القرص", "فتح سطر جديد", "ميجا بايت", "الشاشة", "ديسبل",

            //20
            "الشبكة", "الخادم", "متصفح ويب", "محرك بحث", "الذاكرة", "الميلانين",
            "البطاقة الذكية", "الجيجا هيرتز", "البرنامج", "المبرمج",

            //30
            "برمجيات النظم", "جميع ما ذكر", "لغة الآلة", "مرحلة التطبيق", "3 أيام",
            "الشبكة المحلية", "الميل", "خادم الويب", "المودم", "خديجة",

            //40
            "الثمانينات", "البريد الالكتروني", "كهربائية", "الانيمومتر", "الكيروسين", "الجازولين",
            "من المطاط", "الهيدروجين", "الماء الساخن", "ألماني",

            //50
            "أنطونيو ميوتشي", "كيرك باتريك", "جوجليمو ماركوني", "جون لوجي بيرد", "هوارد آيكن",
            "بليز باسكال", "إرنست سونيتون", "صموئيل كولت", "كارل بنز", "مايكل فاراداي",

            //60
            "كاي لون", "الفريد نوبل", "فلمنج", "اسحاق نيوتن", "جورج ايستمان", "جوزيف اسبن",
            "أديسون", "جورج إستيفنس", "الأنسولين", "بلوتو",

            //70
            "السليكون", "الزئبق", "الماس", "الأوج", "الإنبجاس", "المازوت", "أسيتيلين", "الجاليك",
            "حمض الدُّبَال", "كريسيتول",

            //80
            "صمويل كولت", "الآن شيبرد", "برقان", "امريكي", "هويتكوم جادسون", "امريكي",
            "امريكي", "طفاية الحريق", "أنجلترا", "ألماني",

            //90
            "الزلازل", "العرب", "الانصهار", "راد", "جوجل", "مارك زوكربيرغ", "بيل غيتس",
            "لاري بايج", "تيم بيرنرز لي", "فاير فوكس",

            //100
            "الرام", "أندرويد", "أمازون", "عام 1998", "الإشعاع", "مايكل فارادي", "الشمس",
            "البروتون", "كهرومغناطيسية", "الأمبير"

    };

    // Method return numbers - in the same order as aray of questions
    public int getLength() {
        return listQuestionsTechnology.length;
    }

    // Method return question from array List Questions[] based on array index
    public String getQuestions(int a){
        String question = listQuestionsTechnology[a];
        return question;
    }

    // Method return a single multipe choice item for QUESTION BAES ON ARRAY INDEX,
    // based on number of miltip choice in the list - 1, 2 or 3 as an Argument
    public String getChoice(int index, int num){
        String choice = multipeChoiceTechnology[index][num-1];
        return choice;
    }

    // Method return correct answer for the questions based on array index
    public String getCorrectAnswer(int a){
        String answer = correctAnswerTechnology[a];
        return answer;
    }
}
